NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
#include "esp32s2_algorithm.h"
#include "esp32s2_buff_operations.h"
#include "esp32s2_data_log.h"
#include "esp32s2_parse_data.h"
#include "esp32s2_pac1952.h"
#include "esp32s2_buzzer.h"
#define TAG "inside algorithm.c"
#define TEMP_HIGH_EXIT_THRESHOLD 55.0
//#define DEBUG 1
char dev_id[12];
/*Variable declarations*/
time_t timeinfo = 0;
struct tm* date_time;

algo_param_t algo_param;

volatile uint16_t system_flag;
volatile uint16_t common_flag;
volatile uint8_t server_flag;
volatile uint8_t error_flag = 0;

//Variable initialization

float dc_load_i, sol_bat_chg_i_diff;

//Variables for calibration
float pac_bat_v_const, pac_sol_v_const, uc_bat_v_const, uc_sol_v_const,uc_temp1_const,uc_temp2_const;
float pac_bat_chg_i_const,pac_bat_dis_i_const,pac_bat_chg_i_offset,pac_bat_dis_i_offset, pac_sol_i_const,pac_sol_i_offset;
float pac_bat_p_const, pac_sol_p_const;
int16_t ct_load_i_offset;
float ct_load_i_const;

//Variables for summary
float pac_sol_p, pac_bat_chg_p, pac_bat_dis_p, ac_load_p;
float mains_chg_p, sol_bat_p;


//Variables associated with battery voltage
float bat_max_v, bat_frc_trip_exit_v, bat_frc_trip_exit_v_thr,useable_bat_frc_trip_exit_v, bat_sol_con_v;
uint16_t bat_max_volt_adc;
float bat_mains_chg_in_v, bat_mains_chg_in_v_thr, bat_mains_chg_out_v;

//Variables associated with load
float max_dc_load_i, max_ac_load_i;


uint8_t is_day_flag=0, bat_sol_equ_intr_cnt=0,eve_dy_exit=0,dy_exit=0;
uint16_t bat_sol_equ_dur_cnt=0;

uint8_t morn_chg_inh_flag=0, even_chg_inh_flag=0, bat_sol_equ_intr=0;
uint16_t bat_sol_equ_dur=0;

uint8_t algo_interval_count = 0, is_time_to_log,useable_soc_recal_cnt=0;

uint8_t debug_log_flag = 1, one_hour_log_flag, force_trip_pause_flag = 0;
uint16_t force_trip_pause_count = 0;
uint32_t no_sol_check_count = 0;
uint8_t power_trip_flag, is_time_to_equ=0, bat_full_flag;
uint8_t is_sol_sensed, no_inh_flag, peak_inh_flag, no_frc_trip_flag;

uint8_t low_sol_flag, dc_over_load_flag, dc_under_load_flag,need_solar_mains_top_up;
uint8_t ready_for_frc_trip, mains_chg_flag=0, mains_sol_chg_flag=0, pac_error_flag, pac_error_flag_cnt=0, exception_flag;

uint16_t low_sol_check_count, over_load_check_count, under_load_check_count, mains_topup_count;
uint16_t sol_v_chk_count, num_days;
uint8_t frc_trip_count,prev_frc_trip_count,prev_ft_count=0;
uint8_t prev_hour;
algo_param_t algo_param;
load_soc_v  load;
bat_equ_param_t bat_equ_param;
uint32_t total_time=0;

//v7 Variables 
//Newly included variables
uint8_t battery_low=0,mains_sense_dur=0;
uint8_t enable_cal_useable_soc=0,abs_index=0,battery_type=0,equalization_repeat_counter=0,is_time_to_cal_useable_soc=0,is_time_to_cal_useable_soc_entry=0,load_SOC_vol_index=0,useable_SOC_written=0,useable_soc_cal_failed=0,cal_useable_soc_thr2_cnt=0,cal_useable_soc_thr1_cnt=0;
uint16_t mains_fail_counter=0,equalization_failure_counter=0;
extern uint8_t device_state,turt_state;
float Rated_Bat_AH=0,Bat_SOC=0,battery_high_set=0,VFT_Exit_Higher=0,VFT_Exit_Lower=0;
uint8_t bat_abs_intr_cnt=0,bat_abs_intr=0;
float absorption_current[180];
float MA_absorption_current=0.0;
float previous_voltage=0.0,useable_soc_multiplier=0.0,useable_SOC1=0.0,useable_SOC2=0.0,Useable_SOC_Reducer=0.0;

uint8_t Solar_Time=0,Morning_Sunhour=6;
uint16_t solar_time_seconds=0;
float Today_Recieved_Solar_Energy=0.0,Morning_Solar_Bucket=0,solar_power_bucket[12],Afternoon_Solar_Bucket=0,Day_Morning_Solar_Bucket[3],Day_Afternoon_Solar_Bucket[3],MA_Morning_Solar_Bucket,MA_Afternoon_Solar_Bucket;
float Day_Load_Bucket,Night_Load_Bucket,load_power_bucket[24],Day_Morning_Load_Bucket[7],Day_Night_Load_Bucket[7];
uint8_t Sundown_Time=0,Previous_Day_Morning_Sunhour=6,Previous_Day_Sundown=12;

uint8_t Dynamic_FT_Exit_Enable,Correction_Factor_Enable,Dynamic_FT_Exit,Dynamic_FT_Entry_Enable;
float Correction_Factor;

float B1,B2,C2,AH_Efficiency,FT_Constant;
uint32_t FT_Entry_Time;
uint8_t Dynamic_FT_Enter,Dynamic_FT_Entered;

float SOC_Error=0.0,SOC_Err_Inc=0.0,MA_SOC_Err[4];
uint8_t SOC_Err_Index=0,need_eq_after_abs=0;

uint32_t estimated_ft_entry_time=0,check_ft_entry_time=0;
uint8_t is_time_to_dynamic_ft_entry=0;
float sol_mains_chg_cur_thr=25.0;
float max_solar_current=35.0;
uint8_t stop_solar_chg=0;
uint16_t stop_solar_chg_cnt=0;

float total_bat_capacity=0.0,total_bat_capacity_age_factor=0.4;
float Bat_DoD=0.0;

uint8_t dev_type;
float bat_vol,useable_SOC;
//Testing Purpose
extern uint8_t sol_data[3];
uint8_t user_enable=0;
uint8_t one_time=1;
uint16_t state_flag=0;
uint8_t bat_age=0;
float sol_inst;

uint8_t ft_entry_start_day=0,re_cal_useable_soc_count=0;
uint8_t ft_exit_start_day=0;
uint16_t abs_mains_fail_tolerance=0;
uint16_t equ_fail_tolerance=0;
float useable_soc_1_tolerance=0.0;
float useable_soc_2_tolerance=0.0;
float equ_hys=0.0;
uint8_t useable_soc_1_day_tolerance=0;
uint8_t useable_soc_2_day_tolerance=0;
uint8_t week_completed,weekly_count;
uint8_t soc_reset_flag=0;
float bat_voltage_settable;
uint8_t useable_soc_recal_dur;
uint8_t useable_soc_cal_cnt=0;
uint8_t max_frc_per_day=2;
uint8_t eve_soc_error=0;
uint8_t state_change_reason=0,prev_dev_state=0,one_sec_log_time_out=0,state_change_status=0,state_change_log_interval_duration_seconds=0;
uint8_t solar_cycling=0,dev_state_flag=0;
uint16_t cycling_solar_present_time,cycling_solar_absent_time,total_solar_cycling,solar_correction_cnt,solar_equ_cnt=0;
float cycling_energy=0.0,solar_cycling_energy=0.0;
extern uint8_t test_bit;
extern uint16_t server_stat_bit;
uint8_t sunup_count=0,sundown_count=0,sol_dis_count=0;
uint8_t mains_available=0,switch_pos=0,first_day_soc_reset_flag=0,button_press=0,dynamic_ft_complete=0;
uint8_t fail,sun_down_error=0;
uint32_t server_ft_exit_time=0;
extern float inverter_vol;
float weight1=0.0,weight2=0.0,eve_soc_corr,night_soc_corr;
uint8_t sss=0,sath=0,satm=0,sasd=0,sss_start=0,prev_sss=0,useabe_SoC_start_time=0;
uint16_t sssd=0,sss_start_dur=0;
uint32_t sss_time=0;

