NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
uint8_t sunup_conf_enable=0,readyforsunup=0;
uint16_t timetosunup=0;
extern uint8_t user_device_off;

uint8_t enable_early_ft_entry=0, early_ft_entry=0;


extern https_request_buffer_body_t https_request_buffer_body;

float utility_saving_array[4]={0.00139,0.0028,0.00835,0.0125};

uint8_t prevent_solar_charging=0, prevent_solar_charging_timeout=0; 

extern xSemaphoreHandle connectionSemaphore;
extern xSemaphoreHandle i2cSemaphore;

uint8_t get_dev_type()
{
    return dev_type;
}

void clearOverVoltageFlag(){
    // xSemaphoreTake(i2cSemaphore,portMAX_DELAY);
    // getOverVoltageStatus();
    // xSemaphoreGive(i2cSemaphore);
}

static inline void
prevent_solar_charging_of_device(void) {
    prevent_solar_charging=1;
    prevent_solar_charging_timeout=0;
}

void set_timezone()
{
    setenv("TZ", "UTC-5:30", 1);
    tzset();
}

/*
 * params: none
 * return value: none
 * Brief: The following function gets the time from RTC
 *        It also parses the time value in D/M/Y/H/M/S format for use in data logging
 *        The time acquired is used only for data logging. Sundail is the major time source for algorithm.
 */
void check_time(void){
	time(&timeinfo);
    date_time = localtime(&timeinfo);
    ESP_LOGI(TAG,"%02d-%02d-%02d %02d:%02d:%02d",date_time->tm_mday,1+(date_time->tm_mon),date_time->tm_year+1900,date_time->tm_hour,date_time->tm_min,date_time->tm_sec);
}

void state_change_algorithm() {   
    /*
     * Condition to check whether solar is available. 
     * 1) Checks if Sol_V > Bat_V 
     * 2) Checks the flag set for night indication.  
     * This routine is entered in the morning when solar comes 
     * in and the system is still in night mode
     */
  if(algo_param.cur_sol_v > SOL_HIGH_THR && (is_day_flag == NOW_NIGHT_TIME) && ((readyforsunup==0x01)||(sunup_conf_enable==0x00)))
	{
    /*
     * After detecting solar voltage, the algorithm waits for 5 seconds to ensure sun up.
     */
       if(sunup_count<4)
       {
       sunup_count++;
       }
       else
       {
       sunup_count=0;
    /*
     * Indicates solar panel as been connected to the device. If solar sense is 0 it means solar panel is not connected to the device
     * It is indicated using 1 sec yellow led blink
     */
       sun_down_error = 0;
       is_sol_sensed  = 1;
       clear_system_flag(SF_SOL_DIS); 
    /*
     * This variable holds the total solar wattage received for the day.
     * It is updated every second.
     */
       Today_Recieved_Solar_Energy=0;
    /*
     * These two variables are used to run a clock based on sun up and sun down. 
     * The variable Solar_Time is used to track hour and the variable solar_time_seconds is used to track seconds
     * The hour variable will reset everyday morning when the solar comes in for the first time.
     * The seconds variable increments every one second, and when it reaches 3600 it is reset after incrementing hour by 1. 
     * These variables are extensively used in solar bucketing, load bucketing, server set state, exiting FT at 4:30PM, evening battery charge back and dynamic entry
     */
       Solar_Time=0;
       solar_time_seconds=0;
    /*
     * Feature to enter force trip if battery is 90% full
     */
     enable_early_ft_entry = (algo_param.dev_algo_state!=ALGO_STATE_BAT_SOL_FRC_TRIP_6)&&(algo_param.dev_algo_state!=ALGO_STATE_BAT_FRC_TRIP_4);
    /*
     * Dynamic entry depends on solar energy received for the past three days and load energy observed for the last seven days.
     * If the user has a low load consumption during morning hours, the device cycles the solar energy. This might reflect as low solar energy received.
     * The variable is used to track the time taken for equalization and enter into dynamic force trip if equalization happened for more than 1 hour.
     */
       solar_equ_cnt=0;
    
    /*
     * The purpose of dynamic force trip entry is to utilize solar energy to optimal level possible.
     * After a dynamic entry is completed, the battery should not be charged using mains. This variables blocks the charging of battery from mains after a dynamic entry.
     */
       dynamic_ft_complete=0;

    /*
     * The algorithm buckets load energy only after a proper sun up and sundown has passed.
     * The time of installation of the device is unknown. Upon starting the solar hour and solar seconds are zero. 
     * On day 2, the solar time is reset on sun up, and sun down time is noted at sundown.
     * Only after this correction, the algorithm buckets the load.
     */
       if((num_days>2)&&!(dev_state_flag&Bit(6)))
       {
         Load_Energy_Bucketing();
       }
    
    /*
     * After bucketing the load, the variables used for bucketing are reset.
     */
       reset_load_power_bucket();
       reset_solar_power_bucket();
       
    /*
     * This variable is used to track the number of days passed after installation. The variable will get reset once battery is removed/after a reset either from WDT or server.
     */
       num_days++;
      
    /*
     * Enable sunup confidence check
     */
       if(num_days>2)
       {
           sunup_conf_enable = 1;
       }
       else
       {
           sunup_conf_enable = 0;
       }
       
       readyforsunup = 0;
    /*
     * On first day of installation the device doesn't force trip. It is done by setting the force trip count allowed for the day to maximum value.
     * During regular days the force trip count is set to zero in the morning when solar entry happens 
     */
       if(((num_days<=1)&&(!(dev_state_flag&Bit(2))))||(test_system_flag(SF_INV_FAIL)))
       {
            frc_trip_count = max_frc_per_day;
       }
       else
       {
           ESP_LOGI("DEBUG_ALGO","Setting force trip count as zero");
            frc_trip_count = 0;  
            prev_frc_trip_count = 0;
       }

