NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
    /*
     * Dynamic force trip exit feature is enabled only on the 5th day after installation of device.
     * If a useable SoC calculation failure occurs, the feature gets delayed by a day.
     * This feature can be blocked from the server if required.
     */

       if((num_days>=ft_exit_start_day)&&!(dev_state_flag&Bit(4)))
       {
            Dynamic_FT_Exit_Enable=1;
       }

    /*
     * Dynamic force trip entry feature is enabled only on the 9th day after installation of device.
     * If a useable SoC calculation failure occurs, the feature gets delayed by a day.
     * This feature can be blocked from the server if required.
     */

       if((num_days>=ft_entry_start_day)&&!(dev_state_flag&Bit(3)))
       {
            Dynamic_FT_Entry_Enable=1;
            dynamic_ft_complete=0;
            is_time_to_dynamic_ft_entry=0;
       }
      
    /* 
     * Reset Dynamic Exit and Entry Flag
     */
       Dynamic_FT_Exit=0;
       Dynamic_FT_Enter=0;
       dy_exit=0;

    /* 
     * Battery absorption complete check. 
     */
        
    /*
     * Case 1: If there happens a mains fail on the previous night during absorption, SF_ABS_MF  flag is set.
     * If SF_ABS_MF flag is set, the absorption current is checked.
     */    
     if(test_system_flag(SF_ABS_MF)) 
     {
        for(int i=0;i<180;i++)
        {
        MA_absorption_current+=absorption_current[i];
        }           
        
        MA_absorption_current=MA_absorption_current/180;

    /*
     *  Case 1a: If the SF_ABS_MF flag is set the battery charging tail current is calculated. If it is less than 3A the absorption failed flag is set.Absorption current is set as 0.02 of rated battery AH.
     *  Absorption current value is a moving average value of charging current over a period of 3 minutes.
     */   
        if(MA_absorption_current<(Rated_Bat_AH/50.0))                                                                                                             
        {
        post_system_flag(SF_ABS_COMPLETED);
        clear_system_flag(SF_ABS_MF);
        clear_system_flag(SF_ABS_NEEDED);
        if(enable_cal_useable_soc)
        {
        soc_reset_flag=0;
        }
        }
    /*
     *  Case 1b: Else the SF_ABS_MF flag is reset and SF_ABS_COMPLETED flag is set to indicate the completion of absorption.
     */    
        else
        {
        post_system_flag(SF_ABS_NEEDED);
        clear_system_flag(SF_ABS_MF);
        clear_system_flag(SF_ABS_COMPLETED);
    /*
     * If the absorption was initiated for useable SoC calculation and if the absorption has failed, then useable SoC calculation is re-attempted the next day.
     * If already re-attempted, and it has failed again, the useable SoC calculation is considered a failure.
     */
        if(enable_cal_useable_soc)
        {
        if(re_cal_useable_soc_count>1)
        {
        enable_cal_useable_soc=0;
        need_eq_after_abs=0;
        post_system_flag(SF_USEABLE_SOC_FAILED);
        frc_trip_count = 0;  
        re_cal_useable_soc_count=0;
        //useable SoC Calculation failed
        }
        else
        {
        ft_exit_start_day++;
        ft_entry_start_day++;
        post_system_flag(SF_USEABLE_SOC_CAL);
        }
        }
        
        }
    }
    /*
     *  Case 2: If the flag is not set SF_ABS_COMPLETED flag is set to indicate completion of absorption.
     */    
    else
    {
        if(test_system_flag(SF_ABS_NEEDED)==0)
        {
        if(enable_cal_useable_soc)
        {
        soc_reset_flag=0;
        }
        post_system_flag(SF_ABS_COMPLETED);
        clear_system_flag(SF_ABS_MF);
        clear_system_flag(SF_ABS_NEEDED);
        }
    }
            
    /*
     *  This variable is used to count the availability of solar during the states 3,6 and 7 by checking the current.
     *  If the solar current is less than specified value for more than 5 minutes the device .
     */
        no_sol_check_count = 0;
    
    /*
     * This flag indicates day or night. It is set during sun up and reset during sundown.
     * This variable is sent to the server during payload. The sun up time of the device is detected by the server using this flag.
     * Using this time the server corrects for the state change entry time. This correction is considered because of IST issues.
     */
        is_day_flag = NOW_DAY_TIME;
        
    /*
     * This flag indicates whether to inhibit the battery or to continue with mains charging
     * This variable is used to enter into battery absorption
     */        
        no_inh_flag = 0;       

    /* Equalization is done only if the battery is a tubular battery.
     * Night before equalization absorption is done.
     * Equalization is done only if absorption is complete.
     * Periodic equalization interval can be set between 30 to 120days.
     */
       if(battery_type==TUBULAR)
       {
       bat_sol_equ_intr_cnt+=1;

       /*
        * It tracks the equalization day and initiates absorption the day before equalization.
        */
       if(bat_sol_equ_intr_cnt==bat_sol_equ_intr)
       {
       post_system_flag(SF_ABS_NEEDED);
       }
       
       /* 
        * This code initiates equalization.
        */
        if((((bat_sol_equ_intr != 0) && (bat_sol_equ_dur != 0 )) && (bat_sol_equ_intr_cnt > bat_sol_equ_intr)) || test_system_flag(SF_EQ_NEEDED)){
            if(test_system_flag(SF_EQ_NEEDED)){
                clear_system_flag(SF_EQ_NEEDED);
                equalization_repeat_counter++;
            /*
            * If equalization repeat counter reaches 2 set equalization failed flag and clear equalization needed flag.
            */
                if(equalization_repeat_counter>1)
                {
                clear_system_flag(SF_EQ_NEEDED);
                post_system_flag(SF_EQ_FAILED);
                is_time_to_equ=0;
                }
                else
                {
                is_time_to_equ=1;
                }
            }
            else{
                /*
                * Incase absorption initiated on the previous day is not complete, equalization is not performed.
                */ 
                if(test_system_flag(SF_ABS_NEEDED)){
                /*Postpone the equalization*/
                    is_time_to_equ = 0;
                    post_system_flag(SF_EQ_NEEDED);
                }
                else
                {
                is_time_to_equ = 1;
                }
            }
        }

                    
