NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
        /*
         * Case 2: During equalization day the battery cycles between battery voltage+(battery voltage)/4 and (battery voltage+(battery voltage)/4)-0.4
         */
        if((test_system_flag(SF_ABS_COMPLETED))&&(is_time_to_equ==1))
        {
            is_time_to_equ=1;
            bat_voltage_settable=bat_vol+(bat_vol/4.0);
            bat_max_volt_adc= (uint16_t) (bat_voltage_settable/uc_bat_v_const);
        }
        /*
         * Case 1: During regular days once battery voltage hits maximum and FT is not allowed to happen the battery cycles between bat_max_v and bat_max_v-0.4
         */
        else
        {
            is_time_to_equ=0;
            bat_voltage_settable=bat_max_v;
            bat_max_volt_adc= (uint16_t) (bat_voltage_settable/uc_bat_v_const);
        }
        }
        /*
         * If the battery is not of tubular type, then the battery is only cycled using solar.
         * Equalization is not performed on non-tubular batteries.
         */
        else
        {
            is_time_to_equ=0;
            bat_voltage_settable=bat_max_v;
            bat_max_volt_adc= (uint16_t) (bat_voltage_settable/uc_bat_v_const);
        }

        /*The absorption feature is available for all battery types*/
        /*Absorption can be done every 4 to 7days*/
        if(++bat_abs_intr_cnt>bat_abs_intr)
        {
            bat_abs_intr_cnt=0;
            post_system_flag(SF_ABS_NEEDED);
        }

        if(enable_cal_useable_soc==1)
        {
          frc_trip_count = max_frc_per_day;  
        }
            
        }
    }

    /*
     * This code detects whether the solar panel is disconnected or a sundown occurs.
     * During a solar panel disconnect, the solar voltage falls to zero in no time, where as during a sundown the voltage takes minutes to fall to zero.
     * This logic is used in determining the condition that occurred.
     */
    else if((algo_param.cur_sol_v < SOL_LOW_H_THR) && (algo_param.cur_sol_v > SOL_LOW_L_THR) && (is_day_flag == NOW_DAY_TIME))
	{
    
    /*
     * If the voltage goes below a certain specified value which is provided to detect sundown, the algorithm waits for 30 seconds to ensure it.
     */
        if(sundown_count<30)
        {
            sundown_count++;
        }
        else
        {
    /*
     * After two days from installation, after the voltage falls, check if the solar hour is greater than the previous day's sundown hour.
     * If the solar hour is greater, then it is considered as a sundown.
     */
            if(num_days>2)
            {
                if(Solar_Time>=(Previous_Day_Sundown-1))
                {
                    sun_down_routine();
                }
                else
                {
                sun_down_error=1;
                sol_dis_count=0;
                is_sol_sensed=0;
                reset_parameters();
                sundown_count=0;
                }
            }
            else
            {
                sun_down_routine();
                sundown_count=0;
            }
        }
    }
    
    /*
     * If the solar voltage drops less than a set voltage, and if it stays there for 20seconds it is considered as solar disconnect.
     */
    if((algo_param.cur_sol_v < SOL_LOW_L_THR) && (is_day_flag == NOW_DAY_TIME))
    {
        if(sol_dis_count<20)
        {
            sol_dis_count++;
        }
        else
        {
            sun_down_error=1;
            sundown_count=0;
            sol_dis_count=0;
            is_sol_sensed=0;
            reset_parameters();
            post_system_flag(SF_SOL_DIS);
        }
    }
    
    total_time=(((uint32_t)Solar_Time*(uint32_t)3600)+(uint32_t)solar_time_seconds);
    
    if(enable_early_ft_entry){
        if((total_time>7200)&&(algo_param.dev_algo_state!=ALGO_STATE_BAT_SOL_FRC_TRIP_6)&&(algo_param.dev_algo_state!=ALGO_STATE_BAT_FRC_TRIP_4)&&(Bat_SOC>0.9*total_bat_capacity)){
            early_ft_entry=1;
            //enable_early_ft_entry=0; // Specially disabled for a customer
        }
    }

    if((is_time_to_cal_useable_soc_entry)&&((enable_early_ft_entry)||(early_ft_entry))){
        enable_early_ft_entry=0;
        early_ft_entry=0;
    }

    /*
     * Once dynamic exit is enabled, during state 4 and state 6 a rule check is done so that the FT exit happens.
     * This is to ensure that the battery is completely full at sundown.
     */
    if((algo_param.dev_algo_state == ALGO_STATE_BAT_SOL_FRC_TRIP_6) || (algo_param.dev_algo_state == ALGO_STATE_BAT_FRC_TRIP_4))
    {
        Dynamic_FT_Exit_Algorithm();
    }
    
    /* Mains Fail Check during Absorption.
     * On absorption days, mains fail during night time is detected.
     * If the mains fail persisted for more than three hours SF_ABS_MF is set. 
     * The duration of mains fail can be changed as required either from server or using APP.
     */
    if(no_inh_flag&&(is_day_flag==NOW_NIGHT_TIME))
    {
        if((algo_param.cur_dis_i>MIN_DC_LOAD_I)&&(test_system_flag(SF_ABS_MF)==0))
        {
            ++mains_fail_counter;
            if(mains_fail_counter>abs_mains_fail_tolerance)
            {
               post_system_flag(SF_ABS_MF); 
            }
        }
    }

    /* 
     * Battery SoC is reset after every absorption.
     * After absorption the moment the battery reaches maximum voltage, the soc is reset to full capacity
     */
    if((algo_param.cur_bat_v>bat_max_v)&&(soc_reset_flag==0))
    {
        soc_reset_flag=1;
        Bat_SOC=total_bat_capacity;
    /*
     * If the battery is of non-tubular type, after absorption complete the device is set to ready for useable SoC calculation.
     * This is executed, if the absorption was initiated because of a useable SoC calculation.
     */
    if(test_system_flag(SF_ABS_COMPLETED) && (battery_type!=TUBULAR))
    {
        if(enable_cal_useable_soc)
        {
           enable_cal_useable_soc=0;
           is_time_to_cal_useable_soc_entry=1;
           previous_voltage=bat_vol*1.034;
           frc_trip_count = max_frc_per_day;
           Dynamic_FT_Exit_Enable=0; //Dynamic FT does not happen during useable SoC calculation
        }
    }
    }       
    
