NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
    /*
     * On the first day of installation, the battery SoC is set to zero.
     * To correct it on the first day, when the battery voltage hits maximum for the first time, SoC is reset to full capacity.
     */
    if((algo_param.cur_bat_v>bat_max_v)&&(num_days==1))
    {
        Bat_SOC=total_bat_capacity;
    }   
    
    /* 
     * If the battery is tubular and if it is day time and equalization is being done, a counter runs for 6hours.
     * After 6hours if the battery soc has fallen below 95% the equalization process is considered as success.
     * 95% tolerance is given to accommodate any short power failure during equalization
     * Less than 95%, it is considered a failure
     */
    if(is_time_to_equ&&(is_day_flag==NOW_DAY_TIME)&&(battery_type==TUBULAR)) 
	{
            if(++bat_sol_equ_dur_cnt >= bat_sol_equ_dur)
            {
                is_time_to_equ=0;
                force_trip_pause_flag=0;
                force_trip_pause_count=0;
                bat_sol_equ_dur_cnt = 0;
               
                /* Success*/
                if((soc_reset_flag==1)&&(Bat_SOC>(0.95*total_bat_capacity)))
                {
                if(need_eq_after_abs==0)
                {
                    bat_sol_equ_intr_cnt = 0;
                }
                previous_voltage=bat_vol*1.034;
                need_eq_after_abs=0;
                if(enable_cal_useable_soc)
                {
                    enable_cal_useable_soc=0;
                    is_time_to_cal_useable_soc_entry=1;
                    frc_trip_count = max_frc_per_day;
                    Dynamic_FT_Exit_Enable=0; /*Dynamic FT does not happen during useable SoC calculation*/
                }
                post_system_flag(SF_EQ_COMPLETED);
                }
                /*Failure*/
                else
                {
                if(enable_cal_useable_soc)
                {
                /*
                 * If the equalization was initiated for useable SoC calculation and if the equalization has failed, then useable SoC calculation is re-attempted the next day.
                 * If already re-attempted, and it has failed again, the useable SoC calculation is considered a failure.
                 */
                fail=3;
                re_cal_useable_soc_count++;
                if(re_cal_useable_soc_count>1)
                {
                    enable_cal_useable_soc=0;
                    post_system_flag(SF_USEABLE_SOC_FAILED);
                    need_eq_after_abs=0;
                    re_cal_useable_soc_count=0;
                    //useable SoC Calculation failed
                }
                else
                {
                    ft_exit_start_day++;
                    ft_entry_start_day++;
                    post_system_flag(SF_USEABLE_SOC_CAL);
                }
                }
                else
                {
                    post_system_flag(SF_EQ_FAILED);
                }
                }
            }
	}
    
    /*
     * After the completion of absorption, (and equalization if tubular battery) the device is ready to force trip if a useable SoC calculation is needed.
     * The force trip is initiated if a mains fail occurs or if the solar time reaches specified time. 
     * This time can be changed using APP/Server
     */
    if(is_time_to_cal_useable_soc_entry==1)
    {
    if(mains_available==0)
    {
    force_trip_pause_flag=0;
    frc_trip_count=0;
    no_frc_trip_flag = 0;
    ready_for_frc_trip = 1;
    is_time_to_cal_useable_soc_entry=0;
    is_time_to_cal_useable_soc=1;
    }
    else
    {
    if(Solar_Time>=useabe_SoC_start_time)
    {
    force_trip_pause_flag=0;
    frc_trip_count=0;
    no_frc_trip_flag = 0;
    ready_for_frc_trip = 1;
    is_time_to_cal_useable_soc_entry=0;
    is_time_to_cal_useable_soc=1;
    }
    }
    }

    /*
     * To understand the state transition cause.
     * Every sec the variable is reset, a value will be written only during state transition.
     */
     state_change_reason=0;
    
    /*
     * If force trip count for the day reaches maximum allowable value, force trip will not happen for the reset of the day.
     */
    if((frc_trip_count >= max_frc_per_day))
	{
        ESP_LOGI("DEBUG_ALGO", "Force trip count [%d] reached Max force trip count [%d]",
                frc_trip_count,max_frc_per_day);
		no_frc_trip_flag = 1;
	}

    /*
     * A time period of 30 minutes is assigned between two consecutive force trips
     */
	if(force_trip_pause_flag)
	{
		if(force_trip_pause_count < FRC_TRIP_PAUSE_DUR_SEC)
		{
			force_trip_pause_count++;
		}
		else
		{
				force_trip_pause_count = 0;
				force_trip_pause_flag = 0;
		}

	}
    
    /*
     * At sundown if the battery soc is less than 0.9 of total capacity the battery is charged back to full capacity using mains
     */
    if(eve_soc_error)
    {
        if(Bat_SOC>=eve_soc_corr*total_bat_capacity)
        {
            eve_soc_error=0;
            clear_system_flag(EVE_SOC_ERR);
            mains_sol_chg_flag = 0;
            if(test_system_flag(SF_SMC))
            {
                clear_system_flag(SF_SMC);
            }
            mains_chg_flag=0;
        }
    }
    
    /*
     * If the battery voltages goes critical, the battery is charged using mains (and solar if available).
     */
	if((algo_param.cur_bat_v < bat_mains_chg_in_v) && (need_solar_mains_top_up == 0))
	{
		need_solar_mains_top_up=1;
        mains_sol_chg_flag = 1;
        post_system_flag(SF_SMC);
		mains_topup_count = 0;
	}

    /*
     * If mains+solar charging is allowed and if battery voltage reaches the required value the mains recharge is cut.
     * Since voltage of old batteries reach full voltage faster a time out of 30 minutes is provided. 
     * During this 30 minutes, once the battery voltage hits full the battery will be cycled using solar.
     */
	if(need_solar_mains_top_up)
	{
    if(mains_topup_count < MIN_MAINS_TOPUP_DUR_SEC)
    {
        mains_topup_count++;
    }
    if((Bat_SOC >= night_soc_corr*total_bat_capacity) && \
        (mains_topup_count >= MIN_MAINS_TOPUP_DUR_SEC))
    {
        clear_system_flag(NGT_SOC_ERR);
        need_solar_mains_top_up = 0;
        mains_sol_chg_flag = 0;
        if(test_system_flag(SF_SMC))
        {
          clear_system_flag(SF_SMC);
        }
        mains_chg_flag=0;
        mains_topup_count = 0;
    }
	}

