NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
    /*
     * If solar panel is disconnected from device for some reason.
     * If both solar voltage and solar current are less than minimum for 1day.
     * solar sensed is reset and LED yellow blinks every one second.
     */
     
	if((algo_param.cur_sol_v < bat_max_v) && (algo_param.cur_sol_i < MIN_SOL_I))
	{
    if(no_sol_check_count < NO_SOLAR_DETECT_DUR_SEC)
    {
        no_sol_check_count++;
    }
    else
    {
        is_sol_sensed = 0;
    }
	}
	else
	{
		no_sol_check_count = 0;
	}

    /*
     * During state 3, state 6 and state 7 since solar switch is closed, the voltage across solar panel will be equal to battery voltage.
     * Hence to check for presence of solar the solar current is checked.
     * If the current is less than the minimum solar current for 3 minutes low solar flag is set.
     * This flag is used to exit from states in which the solar switch is closed.
     */
    
    
	if((algo_param.dev_algo_state == ALGO_STATE_BAT_SOL_FRC_TRIP_6) || \
		(algo_param.dev_algo_state == ALGO_STATE_SOL_INV_DIS_7)||(algo_param.dev_algo_state == ALGO_STATE_SOL_CHG_3))
	{
		if(algo_param.cur_sol_i < MIN_SOL_I)
		{
			if(low_sol_check_count < LOW_SOL_DETECT_DUR_SEC)
			{
				low_sol_check_count++;
			}
			else
			{
				low_sol_flag = 1;
				low_sol_check_count = 0;
			}
		}
		else
		{
			low_sol_flag = 0;
			low_sol_check_count = 0;
		}
	}
	else
	{
		low_sol_flag = 0;
		low_sol_check_count = 0;
	}	


    /*
     * During state 4 and state 6 to prevent overload trip of inverter, the current is being checked.
     * If current is more than the maximum allowable current for more than 5sec the overload flag is set.
     */
	if((algo_param.dev_algo_state == ALGO_STATE_BAT_SOL_FRC_TRIP_6) || \
		(algo_param.dev_algo_state == ALGO_STATE_BAT_FRC_TRIP_4))
	{
		if(dc_load_i > max_dc_load_i)
		{
            is_time_to_log=1;
			if(over_load_check_count < DC_OVER_LOAD_DETECT_DUR_SEC)
			{
				over_load_check_count++;
			}
			else
			{
                ESP_LOGI("DEBUG_ALGO","DC LOAD CURRENT [%f] GREATER THAN MAX ALLOWED DC LOAD CURRENT [%f]",
                        dc_load_i,max_dc_load_i);
				dc_over_load_flag = 1;
				over_load_check_count = 0;
			}
		}
		else
		{
			dc_over_load_flag = 0;
			over_load_check_count = 0;
		}
     /*
      * The following code checks for the failure of the inverter.
      * An inverter connected to battery will consume a no-load current of 1.5A minimum.
      * If the battery discharge current during FT is less than this minimum value, then it means the inverter has failed.
      */
#warning "Inverter fail detection enabled"
#if 1

		if(dc_load_i < MIN_DC_LOAD_I)
		{
            is_time_to_log=1;
			if(under_load_check_count < LOW_DC_LOAD_DETECT_DUR_SEC)
			{
				under_load_check_count++;
			}
			else
			{
                ESP_LOGI("DEBUG_ALGO" , "DC LOAD CURRENT [%f] < MIN_DC_LOAD_I [%f], SETTING DC UNDER LOAD FLAG", dc_load_i,MIN_DC_LOAD_I);
				dc_under_load_flag = 1;
				under_load_check_count = 0;
			}
		}
		else
		{
			dc_under_load_flag = 0;
			under_load_check_count = 0;
		}
#endif
	}
	else
	{
		dc_over_load_flag = 0;
		dc_under_load_flag = 0;
		over_load_check_count = 0;
		under_load_check_count = 0;
	}

    /*
     * During equalization and force trip pause for 30mins and no force trip for the day.
     * Ready for force trip flag is cleared.
     * Once it is cleared the algorithm can go to any state except 4 and 6
     */
     
	if((is_time_to_equ == 0) && (force_trip_pause_flag == 0) && \
		(no_frc_trip_flag == 0)&&(test_system_flag(SF_INV_FAIL)==0))
	{
		ready_for_frc_trip = 1;
	}
	else
	{
		ready_for_frc_trip = 0;
	}

     
    if(test_system_flag(SF_INV_FAIL))
    {
        if(dc_load_i > MIN_DC_LOAD_I)
        {
            is_time_to_log=1;
            clear_system_flag(SF_INV_FAIL);
            frc_trip_count = prev_frc_trip_count;
        }
    }
         
    /*
     * If peak inhibition flag is set mains charging is denied
     */
	if(peak_inh_flag)
	{
		mains_chg_flag = 0;
	}
	else
	{
    /*
     * During absorption or battery critical, battery is charged from mains by setting mains_chg_flag
     */
		if((no_inh_flag == 1) || (need_solar_mains_top_up==1))
		{
               mains_chg_flag = 1;
		}
		else
		{
			mains_chg_flag = 0;
		}
	}


    /*
     * Dynamic force trip exit feature is provided to ensure that the battery is fully charged at sundown.
     * Forecasting the previous solar pattern and the present battery SoC the decision to exit FT is done.
     */
    if(((algo_param.dev_algo_state == ALGO_STATE_BAT_SOL_FRC_TRIP_6) || \
		(algo_param.dev_algo_state == ALGO_STATE_BAT_FRC_TRIP_4))&&(is_time_to_cal_useable_soc==0)&&(is_time_to_dynamic_ft_entry==0)&&(is_day_flag == NOW_DAY_TIME)&&(sss_start==0))
    {
        if(total_time>(((uint32_t) Previous_Day_Sundown *(uint32_t) 3600)-(uint32_t)5400))
        {
            Dynamic_FT_Exit_Enable=0;
            Dynamic_FT_Exit=0x00;
            no_frc_trip_flag = 1;
            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 25 [EVEN FT EXIT !]");
            state_change_reason=25; //Evening FT Exit
            eve_dy_exit=1;
            ready_for_frc_trip=0;  
            frc_trip_count=max_frc_per_day;
            
            if(is_time_to_dynamic_ft_entry)
            {
                if(is_day_flag==NOW_NIGHT_TIME)
                {
                    dynamic_ft_complete=1;
                }
                is_time_to_dynamic_ft_entry=0;
            }
        }
    }
    
    /*
     * If useable soc calculate start is enabled the device moves to state 4. 
     */
	if(is_time_to_cal_useable_soc)
    {
        if(algo_param.dev_algo_state!=ALGO_STATE_BAT_FRC_TRIP_4)
        {
           algo_param.dev_algo_state=ALGO_STATE_BAT_FRC_TRIP_4; 
           ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 24 [USEABLE SOC FT ENTRY]");
           state_change_reason=24; //Useable SoC FT entry
        }
    }
    
