NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
    /*
     * If dynamic force trip entry enable feature is enabled.
     * The system time is checked with the estimated ft entry time calculated and sundown.
     * Required actions are taken based on the rule check.
     */
       Dynamic_FT_Entry_Algorithm();
    
    /*
     * At sundown if the battery SoC falls below 90% of total capacity charge back to 90%.
     * The battery will not be charged back if the battery was discharged during dynamic entry. 
     */
    if((is_day_flag == NOW_NIGHT_TIME)&&(Bat_SOC<(night_soc_corr*total_bat_capacity))&&(is_time_to_dynamic_ft_entry==0)&&(no_inh_flag==0)&&(num_days!=0)&&(dynamic_ft_complete==0)&&(is_time_to_cal_useable_soc==0)&&(is_sol_sensed!=0))
    {
        need_solar_mains_top_up=1;
        post_system_flag(NGT_SOC_ERR);
    }
    
    
    /*
     * This variable indicates the state of the algorithm. 
     * This variable is sent to the server and is mainly used for debugging purpose
     */
       
    state_flag=(uint16_t) (sun_down_error<<14)|(is_day_flag<<13)|(mains_available<<12)|(is_sol_sensed<<11)|(is_time_to_dynamic_ft_entry<<10)|(enable_cal_useable_soc<<9)|(mains_chg_flag<<8)|(need_solar_mains_top_up<<7)|(Dynamic_FT_Entry_Enable<<6)|(Dynamic_FT_Exit_Enable<<5)|(is_time_to_cal_useable_soc_entry<<4)|(is_time_to_cal_useable_soc<<3)|(no_inh_flag<<2)|(is_time_to_equ<<1)|(need_eq_after_abs);
    
    /*
     * If the rule check of dynamic exit is positive, exit flag is set.
     * Ready for force trip flag is reset and no more force trip can happen for the day.
     */
    if(Dynamic_FT_Exit==0x01) //Solar Bucketing Code
    {
        
        if(is_time_to_dynamic_ft_entry)
        {
            if(is_day_flag==NOW_NIGHT_TIME)
            {
                dynamic_ft_complete=1;
            }
            is_time_to_dynamic_ft_entry=0;
        }
        
        if(test_common_flag(CF_FT_EXIT))
        {
            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 27 [SERVER SET DYN EXIT]");
            state_change_reason=27; //Server set dynamic exit
            clear_common_flag(CF_FT_EXIT);
            i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);
        }
        else
        {
            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 23 [DYN FT EXIT !]");
            state_change_reason=23; //Dynamic FT exit
        }
        /*This is to avoid race condition in FT Entry and Exit*/
        Dynamic_FT_Exit_Enable=0;
        Dynamic_FT_Exit=0x00;
        no_frc_trip_flag = 1;
        force_trip_pause_flag = 1;
        force_trip_pause_count = 0;
        dy_exit = 1;
        ready_for_frc_trip=0;
    }
    
    /*
     * If solar panel is connected and there is no error in pac current sensing, the algorithm is enabled
     */
    //if(is_sol_sensed && (pac_error_flag == 0) && (pac_error_flag_cnt==0))  // TODO - VINEETH [FOR PAC ERROR]
    if(is_sol_sensed && (pac_error_flag == 0))  // TODO - VINEETH  - Consider pac_error if 3 times continously pac reading error is hit
	{
        // WDT_Fcn(); 
		switch(algo_param.dev_algo_state)
		{
            /*
             * State five the load and battery are on mains.
             * If the mains fail, then it is called inverter mode
             */
			case ALGO_STATE_INV_5:
                clearOverVoltageFlag();
				bat_full_flag = 0;
				if(exception_flag == 0)
				{
                    /*If there is mains and if mains recharge is not required the device moves to state 1*/
                    /*Solar and mains charge the battery together*/
                    if(sss_start)
                    {
                        //Do Nothing   
                    }
					else if((algo_param.cur_sol_v > bat_max_v)&&(algo_param.cur_bat_v<bat_sol_con_v)&&((mains_sol_chg_flag==1)||(mains_chg_flag==1)))
                    {
                        if(mains_sol_chg_flag==1)
                        {
                            mains_sol_chg_flag = 1;
                            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 1 [MAINS + SOLAR CHARGING]");
                            state_change_reason=1; //Mains+solar charging
                        }
                        else
                        {
                            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 4 [MAINS CHG NECESSARY]");
                            state_change_reason=4; //Mains charging necessary and mains is available
                        }

                        if (prevent_solar_charging==0){
                            algo_param.dev_algo_state = ALGO_STATE_SOL_INV_DIS_7;
                        }
                    }
                    else if((algo_param.cur_dis_i < MIN_DIS_I) && \
						(mains_chg_flag == 0)&&(mains_sol_chg_flag == 0))
					{
						algo_param.dev_algo_state = ALGO_STATE_CHARG_INHIBIT_1;
                        solar_cycling=0;
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 2 [MAINS AVAILABLE]");
                        state_change_reason=2; //Mains available
					}
                    /*If mains fail, solar is available and battery is not full the algorithm goes to state 7*/
					else if(((algo_param.cur_dis_i > MIN_DIS_I) || (algo_param.cur_chg_i < MIN_CHG_I)) && \
							(algo_param.cur_bat_v < bat_sol_con_v) && \
							(algo_param.cur_sol_v > bat_max_v)&&(mains_chg_flag==0)&&(mains_sol_chg_flag == 0))
					{
                        if(prevent_solar_charging==0){
                            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 3 [MAINS FAILED AND SOLAR AVAILABLE !!]");
                        state_change_reason=3;

						algo_param.dev_algo_state = ALGO_STATE_SOL_CHG_3; //Mains failed and solar available
                        solar_cycling=1;
                        }
					}
				}	
				break;
            /*State 1 is the state where the battery is neither charged from solar nor from mains*/
            /*This state occurs during non-absorption days during night, during equalization and during peak inhibition if configured*/
            /*This is a major state. It can branch to any state except state 6*/
                
			case ALGO_STATE_CHARG_INHIBIT_1:
                clearOverVoltageFlag();
				if(exception_flag == 0)
				{
                    /*In order to prevent the sudden inrush of current during state 1 to state 5 transition, it has to go through state 4*/
                    if(sss_start)
                    {
                        
