NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
                    }
					else if(((mains_chg_flag == 1)||(mains_sol_chg_flag==1)))
					{
						switch_state_4_5();
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 5 [MAINS CHGING NECESSARY]");
                        state_change_reason=5; //Mains charging necessary
                        solar_cycling=0;
					}
                    /*If night time and dynamic ft entry is set it moves to state 4*/
                    /*It is made sure that ac load is less than the maximum load current the inverter can deliver*/
                    else if((is_day_flag==NOW_NIGHT_TIME)&&(is_time_to_dynamic_ft_entry)&&(algo_param.cur_ac_load_i < max_ac_load_i))
                    {
                        algo_param.dev_algo_state = ALGO_STATE_BAT_FRC_TRIP_4;
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 6 [DYNAMIC FT ENTRY]");
                        state_change_reason=6; // Dynamic FT Entry
                        solar_cycling=0;
                    }
                    /*If battery is full, solar voltage is greater than max battery voltage, ac load is less than overload value, ft is allowed*/
					else if((bat_full_flag == 1) && \
							((algo_param.cur_sol_v > bat_max_v)||(early_ft_entry)) && \
							(algo_param.cur_ac_load_i < max_ac_load_i) && \
							(ready_for_frc_trip == 1))
					{
                        if(early_ft_entry){
                            early_ft_entry=0;
                            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 36 [EARLY FT ENTRY]");
                            state_change_reason=36; //Early FT entry
                        }
                        else{
                            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 7 [REG FT ENTRY]");
                            state_change_reason=7; //Regular FT entry
                        }
                        enable_early_ft_entry=0;
                        if(num_days==1)
                        {
                            Bat_SOC=total_bat_capacity;
                        }
						algo_param.dev_algo_state = ALGO_STATE_BAT_FRC_TRIP_4;
                        
                        solar_cycling=0;
					}
                    /*If mains failed*/
					else if(dc_load_i > MIN_DC_LOAD_I)
					{
                        ESP_LOGI("DEBUG_ALGO" , "DC LOAD CURRENT [%f] > MIN_DC_LOAD_I [%f]",
                                dc_load_i,MIN_DC_LOAD_I);
                        /*If solar is available move to state 3*/
						if((algo_param.cur_sol_v > bat_max_v))
						{
                            if (prevent_solar_charging==0){                     
							    algo_param.dev_algo_state = ALGO_STATE_SOL_CHG_3;
                                ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 3 [MAINS FAILED AND SOLAR AVAILABLE]");
                                state_change_reason=3; //Mains failed and solar is available
                                solar_cycling=1;
                            }
						}
                        /*If solar is unavailable move to state 5*/
						else
						{
							algo_param.dev_algo_state = ALGO_STATE_INV_5;
                            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 8 [MAINS FAILED AND SOLAR UNAVAILABLE]");
                            state_change_reason=8; //Mains failed and solar unavailable
                            solar_cycling=0;
						}
					}	
                    /*If solar is available and solar voltage is greater than settable-hysterisis transit to state 3*/ 
                    /*settable depends on regular day or equalization day*/
					else if((algo_param.cur_bat_v < bat_sol_con_v) && \
						(algo_param.cur_sol_v > (bat_voltage_settable-equ_hys)))
					{
                        if(prevent_solar_charging==0){
                            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 9 [SOLAR AVAILABLE BAT NOT FULL]");
                        state_change_reason=9; //Solar available and battery not full
                        solar_cycling=1;
						algo_param.dev_algo_state = ALGO_STATE_SOL_CHG_3;
                        }
					}
				}

				break;
			
            /*If battery voltage reaches maximum transit to state 1*/
            /*Settable depends on regular or equalization day*/    
			case ALGO_STATE_SOL_CHG_3:
				if((algo_param.cur_bat_v > bat_voltage_settable) || \
					(low_sol_flag == 1)||(mains_sol_chg_flag==1)||(early_ft_entry)){
                    solar_cycling=1;
                    if((algo_param.cur_bat_v > bat_max_v)||(early_ft_entry))
					{
                        prevent_solar_charging_of_device();
						bat_full_flag = 1;
					}
                    if((algo_param.cur_bat_v > bat_voltage_settable))
                    {
                        solar_cycling=1;
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 10 [BAT V REACHED MAX]");
                        state_change_reason=10; //Battery voltage reached maximum
                        solar_equ_cnt++;
                    }
                    if((low_sol_flag == 1))
                    {
                        low_sol_flag = 0;
                        solar_cycling=1;
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 11 [LOW SOLAR CURRENT EXIT]");
                        state_change_reason=11; //Low solar current exit
                    }
					algo_param.dev_algo_state = ALGO_STATE_CHARG_INHIBIT_1;
				}
				break;

            /*State 4 the load is met by battery and inverter. The load is purposefully disconnected from the mains*/
            /*State 4 can happen either normally or induced purposefully during useable soc calculation*/    
			case ALGO_STATE_BAT_FRC_TRIP_4:
                clearOverVoltageFlag();
				bat_full_flag = 0;
				if(((exception_flag == 0)||(is_time_to_cal_useable_soc))||(is_time_to_dynamic_ft_entry))
				{
                    /*During useable soc calculation, the voltage and dod is calculated for every .2 drop in voltage*/
                
                    if((previous_voltage>algo_param.cur_bat_v+0.1)&&is_time_to_cal_useable_soc)
                    {
                        load.log_SOC[load_SOC_vol_index]=(total_bat_capacity)-Bat_SOC;
                        load.log_voltage[load_SOC_vol_index]=algo_param.cur_bat_v;
                        load.log_current[load_SOC_vol_index]=algo_param.cur_dis_i;
                        previous_voltage=algo_param.cur_bat_v;
                        load_SOC_vol_index+=1;
                    }
                    
                    /*While normal operation the FT exits when battery hits frc trip exit voltage*/
                    /*While calculating useable SOC the FT exits when voltage hits (bat_vol+0.2)-1.0*/
					if((((Bat_DoD>useable_SOC1)||(algo_param.cur_bat_v < bat_frc_trip_exit_v))&&(is_time_to_cal_useable_soc==0)) || \
						(dc_over_load_flag == 1) || \
						(dc_under_load_flag == 1) || \
						(ready_for_frc_trip == 0)||((algo_param.cur_bat_v < useable_bat_frc_trip_exit_v)&&(is_time_to_cal_useable_soc==1))||(eve_dy_exit==1)||(dy_exit==1))
					{
                        if(sss_start==1)
                        {
                            sss_start=0;
                            prev_sss=0;
                            sss_start_dur=0;
                            clear_common_flag(CF_SS);
                            i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);
                        }
                        /*If during useable soc calculation it exits because of overload*/
                        /*Set useable soc calculation failed*/
                        if((dc_over_load_flag == 1)||(dc_under_load_flag == 1)||(ready_for_frc_trip == 0)||(dy_exit==1)||(eve_dy_exit==1))
                        {
                            
