NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
                            if(dc_over_load_flag == 1)
                            {
                                ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 12 [DC OVERLOAD]");
                                state_change_reason=12; //DC Overload
                            }
                            
                            if(dc_under_load_flag == 1)
                            {
                                ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 13 [DC UNDERLOAD]");
                                state_change_reason=13; //DC Underload
                                post_system_flag(SF_INV_FAIL);
                                prev_frc_trip_count=frc_trip_count;
                                frc_trip_count = max_frc_per_day;
                            }
                            
                            if(ready_for_frc_trip == 0)
                            {
                                if(button_press)
                                {
                                    ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 14 [USER BUTTON PRESS]");
                                    state_change_reason=14; //User button press
                                    button_press=0;
                                }
                                else
                                {
                                    ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 15 [NOT READY FOR FT]");
                                    state_change_reason=15; //Not ready for FT
                                }
                            }
                            
                            if(eve_dy_exit==1)
                            {
                                ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 25 [EVENING FT EXIT !!]");
                                eve_dy_exit=0;
                                state_change_reason=25; //Evening FT Exit
                                
                            }
                            
                            if(dy_exit==1)
                            {
                                ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 23 [DYNAMIC FT EXIT !!]");
                                dy_exit=0;
                                state_change_reason=23; //Dynamic FT Exit
                            }
                            
                            if((is_time_to_cal_useable_soc))
                            {
                                is_time_to_cal_useable_soc=0;
                                re_cal_useable_soc_count++;
                                if(re_cal_useable_soc_count>1)
                                {
                                    enable_cal_useable_soc=0;
                                    need_eq_after_abs=0;
                                    post_system_flag(SF_USEABLE_SOC_FAILED);
                                    re_cal_useable_soc_count=0;
                                    //useable SoC Calculation failed
                                }
                                else
                                {
                                    ft_exit_start_day++;
                                    ft_entry_start_day++;
                                    post_system_flag(SF_USEABLE_SOC_CAL);
                                }
                            }
                        }
                        
                        /*If it exits because of voltage hit*/
                        if((((Bat_DoD>useable_SOC1)||(algo_param.cur_bat_v < bat_frc_trip_exit_v))&&(is_time_to_cal_useable_soc==0))||((algo_param.cur_bat_v < useable_bat_frc_trip_exit_v)&&(is_time_to_cal_useable_soc==1)))
						{
                            if(is_time_to_cal_useable_soc)
                            {
                                ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 16 [USEABLE SOC CALC EXIT]");
                                state_change_reason=16; //Useable SoC Calculation Exit
                            }
                            else
                            {
                                if((Bat_DoD>useable_SOC1))
                                {
                                    ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 17 [DOD VIOLATION EXIT]");
                                    state_change_reason=17; //Exit due to DoD violation
                                }
                                else
                                {
                                    ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 18 [VOLTAGE VIOLATION]");
                                    state_change_reason=18; //Exit due to voltage violation
                                }
                            }
                            
                            /*If calculate useable soc is set*/
                            if(is_time_to_cal_useable_soc)
                            {
                                
                                load.log_SOC[load_SOC_vol_index]=(total_bat_capacity)-Bat_SOC;
                                load.log_voltage[load_SOC_vol_index]=algo_param.cur_bat_v;
                                load.log_current[load_SOC_vol_index]=algo_param.cur_dis_i;
                                previous_voltage=algo_param.cur_bat_v;
                                load_SOC_vol_index+=1;
                                
                                /*Set the AH that the battery can deliver as the total capacity of the battery. 1.12 is accounted for the extra energy available in the battery since
                                 it is not drained to its maximum capacity*/
                                useable_SOC1=load.log_SOC[load_SOC_vol_index-1]*useable_soc_multiplier;
                                useable_SOC_written=1; 
                                
                                /*Once useable soc is calculated SF_USEABLE_SOC_RC flag is set*/
                                /*RC indicates rule change*/
                                post_system_flag(SF_USEABLE_SOC_RC);
                                                                
                                /*Log the time at which the rule change occurred*/
                                load.date_time[0] = date_time->tm_mday;   //Set day
                                load.date_time[1] = date_time->tm_mon;    //Set month
                                load.date_time[2] = date_time->tm_year;   //set year
                                load.date_time[3] = date_time->tm_hour;   //Set Hour
                                load.date_time[4] = date_time->tm_min;    //Set minute
                                
