NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
                                /*
                                 * The following code is removed
                                 * This causes early exit from FT due to current compensation value of exit voltage
                                 */
//                                /*Calculate the new exit voltage threshold value*/
//                                for(int i=load_SOC_vol_index-1;i>=0;i--)
//                                {
//                                    if(useable_SOC1>load.log_SOC[i])
//                                    {
//                                      /*Update force trip exit threshold*/  
//                                      bat_frc_trip_exit_v_thr=((((useable_SOC1-load.log_SOC[i])/(load.log_SOC[i+1]-load.log_SOC[i]))*(load.log_voltage[i+1]-load.log_voltage[i]))+load.log_voltage[i])+(0.02*((load.log_current[i+1]+load.log_current[i])/2)); 
//                                      break;
//                                    }
//                                }
//                                /*Check if the force trip exit threshold is within limits.If limits are satisfied keep the value*/
//                                /*If calculated value is more than the higher bound, set higher bound as the exit value*/
//                                /*If it is lower than the lower bound, set exit voltage as (bat_max_v/80)+(lower bound)*/
//                                
//                                if(bat_frc_trip_exit_v_thr>VFT_Exit_Higher)
//                                {
//                                    bat_frc_trip_exit_v_thr=VFT_Exit_Higher;
//                                }
//                                else
//                                {
//                                    if(bat_frc_trip_exit_v_thr<VFT_Exit_Lower)
//                                    {
//                                        bat_frc_trip_exit_v_thr = VFT_Exit_Lower;
//                                    }
//                                }
//                                
//                                bat_mains_chg_in_v_thr=bat_frc_trip_exit_v_thr-0.2;
                                
                                //Clear the useable soc calculate flag
                                clear_system_flag(SF_USEABLE_SOC_CAL);
                                is_time_to_cal_useable_soc=0;
                                need_solar_mains_top_up=1;
                                mains_sol_chg_flag = 1;
                                post_system_flag(SF_SMC);
                                useable_soc_cal_cnt+=1;
                                load_SOC_vol_index=0;
                                
                                dev_state_flag=dev_state_flag|Bit(2);

                                i2c_eeprom_write_byte(DEV_SYS_FLAG,dev_state_flag);
                                vTaskDelay(500);
                                i2c_eeprom_write_float(USEABLE_SOC,useable_SOC1);
                                vTaskDelay(500);
//                                i2c_eeprom_write_float(VFT_EXT_THR,bat_frc_trip_exit_v_thr);
//                                timer_delay_ms(500);
                                i2c_eeprom_write_buff(0xFE81,(uint8_t *) &load,245);
                            }
/*The following code has been removed from new version. 
 The reasons for omitting the code are:-
 * 1. Complexity in calculating the energy discharged by battery during force trip
 * 2. This might lead to a race condition 
 */
                            
/*Instead useable soc will be calculated once in every four months*/
                            else
                            {
                                is_time_to_cal_useable_soc=0;
                                useable_soc_cal_failed=0;
                                
                                if(is_time_to_dynamic_ft_entry)
                                {
                                    if(is_day_flag==NOW_NIGHT_TIME)
                                    {
                                        dynamic_ft_complete=1;
                                    }
                                    is_time_to_dynamic_ft_entry=0;
                                }
                                
                                if((Bat_DoD>useable_SOC1)||(algo_param.cur_bat_v < bat_frc_trip_exit_v))
                                {
                                    frc_trip_count++;
                                }
                            }
           
                        }
                        /*The force trip is paused for 30minutes. Even though the battery becomes full only after 30minutes another force trip will happen*/
                        force_trip_pause_flag = 1;
                        force_trip_pause_count = 0;
                        algo_param.dev_algo_state = ALGO_STATE_INV_5;
                        solar_cycling=0;
                        dy_exit=0;
                        if(is_time_to_dynamic_ft_entry)
                        {
                            if(is_day_flag==NOW_NIGHT_TIME)
                            {
                                dynamic_ft_complete=1;
                            }
                            is_time_to_dynamic_ft_entry=0;
                        }
					}
                    /*If solar is available during normal force trip condition the algorithm moves to solar assisted force trip*/
					else if((algo_param.cur_bat_v < bat_sol_con_v) && \
							(algo_param.cur_sol_v > bat_max_v)&&(is_time_to_cal_useable_soc==0)&&(sss_start==0))
					{
                        if(prevent_solar_charging==0){
                            if(solar_cycling==1)
                            {
                                solar_cycling=1;
                            }
                            algo_param.dev_algo_state = ALGO_STATE_BAT_SOL_FRC_TRIP_6;
                            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 19 [SOLAR AVAILABLE BAT NOT FULL]");
                            state_change_reason=19; //Solar Available and battery not full
                        }
					}
                }
                break;
            /*If the algorithm is in solar assisted force trip and sun down happens or battery gets full it moves to normal force trip*/
			case ALGO_STATE_BAT_SOL_FRC_TRIP_6:
				if((algo_param.cur_bat_v > bat_max_v) || (low_sol_flag == 1) || (ready_for_frc_trip == 0))
				{
                    if(algo_param.cur_bat_v > bat_max_v)
                    {
                        solar_equ_cnt++;
                        solar_cycling=1;
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 10 [BAT VOLTAGE REACHED MAX !!]");
                        state_change_reason=10; //Battery voltage reached max
                        prevent_solar_charging_of_device();
                    }
                    
                    if(low_sol_flag == 1)
                    {
                        low_sol_flag = 0;
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 11 [LOW SOLAR !]");
                        state_change_reason=11; //Low solar 
                        solar_cycling=1;
                    }
					algo_param.dev_algo_state = ALGO_STATE_BAT_FRC_TRIP_4;
				}
            /*If battery voltage reaches lower limit during force trip or overload occurs the algorithm goes to state 5*/
				else if((algo_param.cur_bat_v < bat_frc_trip_exit_v) || \
					(dc_over_load_flag == 1) || \
					(dc_under_load_flag == 1) || \
					(ready_for_frc_trip == 0)||(Bat_DoD>useable_SOC1)||(dy_exit==1)||(eve_dy_exit==1))
				{
                    if(sss_start==1)
                    {
                        sss_start=0;
                        prev_sss=0;
                        sss_start_dur=0;
                        clear_common_flag(CF_SS);
                        i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);
                    }
                    if(algo_param.cur_bat_v < bat_frc_trip_exit_v)
                    {
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 18 [VOL VIOLATION EXIT]");
                        state_change_reason=18; //Exit due to voltage violation
                    }
                    
                    if((Bat_DoD>useable_SOC1))
                    {
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 17 [SOC VIOLATION EXIT]");
                        state_change_reason=17; //Exit due to SoC violation
                    }

