NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
                    if(dc_over_load_flag == 1)
                    {
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 12 [OVERLOAD !]");
                        state_change_reason=12; //Overload
                    }
                    if(dc_under_load_flag == 1)
                    {
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 13 [UNDERLOAD !]");
                        state_change_reason=13; //Underload
                        post_system_flag(SF_INV_FAIL);
                        prev_frc_trip_count=frc_trip_count;
                        frc_trip_count = max_frc_per_day;
                    }
                    if(ready_for_frc_trip == 0)
                    {
                        if(button_press)
                        {
                            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 14 [USER EXIT]");
                            state_change_reason=14; //User exit
                            button_press=0;
                        }
                        else
                        {
                            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 15 [NOT READY FOR FT !]");
                            state_change_reason=15; //Not Ready for FT
                        }
                    }
                    
                    if(eve_dy_exit==1)
                    {
                        eve_dy_exit=0;
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 25 [EVENING EXIT !!!]");
                        state_change_reason=25; //Evening exit

                    }

                    if(dy_exit==1)
                    {
                        dy_exit=0;
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 23 [DYNAMIC EXIT !!!]");
                        state_change_reason=23; //Dynamic exit
                    }
                    
					if(algo_param.cur_bat_v < bat_frc_trip_exit_v)
					{
						frc_trip_count++;
                        ESP_LOGI("DEBUG_ALGO", "Force trip count: %d",frc_trip_count);
					}
                    
					force_trip_pause_flag = 1;
					force_trip_pause_count = 0;
					algo_param.dev_algo_state = ALGO_STATE_INV_5;
                    solar_cycling=0;
                    
                    if(is_time_to_dynamic_ft_entry)
                    {
                        if(is_day_flag==NOW_NIGHT_TIME)
                        {
                            dynamic_ft_complete=1;
                        }
                        is_time_to_dynamic_ft_entry=0;
                    }
				}
				break;
            /*If the state is in solar assisted mains charging, and solar energy is low, the algorithm moves to state 5*/
            /*A feature to charge the battery using both solar and mains have to be implemented here*/
            /*If battery charging current becomes greater than limited value the algorithm should branch to state 3*/    
			case ALGO_STATE_SOL_INV_DIS_7:
				if(((algo_param.cur_bat_v > bat_max_v) || \
					(low_sol_flag == 1) ||(algo_param.cur_chg_i>sol_mains_chg_cur_thr)))
				{
					if(algo_param.cur_bat_v > bat_max_v)
					{
						bat_full_flag = 1;
                        solar_cycling=1;
					}
                    if(algo_param.cur_chg_i>sol_mains_chg_cur_thr)
                    {
                        mains_sol_chg_flag=0;
                        state_change_reason = 35; //Charging current greater than 25A
                        ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 35 [CHARGING CURRENT [%f] > %f]",
                                algo_param.cur_chg_i,sol_mains_chg_cur_thr);
                        if(test_system_flag(SF_SMC))
                        {
                            clear_system_flag(SF_SMC);
                        }
                        algo_param.dev_algo_state = ALGO_STATE_SOL_CHG_3;
                        solar_cycling=0;
                    }
                    else
                    {
                        if(algo_param.cur_bat_v > bat_max_v)
                        {
                            prevent_solar_charging_of_device();
                            if(eve_soc_error==1)
                            {
                               mains_sol_chg_flag=1;
                            }
                            else
                            {
                               mains_sol_chg_flag=0; 
                            }                          
                            if(test_system_flag(SF_SMC))
                            {
                                clear_system_flag(SF_SMC);
                            }
                            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 10 [BAT FULL] [cur bat v: %f > bat_max_v :%f]",
                                    algo_param.cur_bat_v,bat_max_v);
                            state_change_reason=10; //Bat full
                        }
                        if(low_sol_flag == 1)
                        {
                            low_sol_flag = 0;
                            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 11 [LOW SOLAR !!]");
                            state_change_reason=11; //Low solar
                            solar_cycling=1;
                        }
//                        mains_chg_flag=0;
                        algo_param.dev_algo_state = ALGO_STATE_INV_5;
                    }
					
				}
				break;

			default:
				algo_param.dev_algo_state = ALGO_STATE_INV_5;
				break;		
		}
        
        if((total_time>(((uint32_t) Previous_Day_Sundown *(uint32_t) 3600)-(uint32_t)5400))&&(eve_soc_error==0)&&(is_day_flag == NOW_DAY_TIME)&&(is_time_to_cal_useable_soc==0)&&(dynamic_ft_complete==0))
        {
            /*This is to ensure battery is greater than 90% of total capacity during sun down*/
            if(Bat_SOC<(eve_soc_corr*total_bat_capacity))    
            {
                mains_sol_chg_flag = 1;
                post_system_flag(SF_SMC);
                eve_soc_error=1; 
                post_system_flag(EVE_SOC_ERR);
            }
            else
            {
                eve_soc_error=0;
            }
        }
        
#if 1
    if(test_common_flag(CF_SS)&&(total_time>sss_time)&&(sss_start==0))
    {
        if(is_time_to_cal_useable_soc==1)
        {
            is_time_to_cal_useable_soc=0;
        }
        if(is_time_to_dynamic_ft_entry)
        {
            if(is_day_flag==NOW_NIGHT_TIME)
            {
                dynamic_ft_complete=1;
            }
            is_time_to_dynamic_ft_entry=0;
        }
        
        switch(sss)
        {
            case ALGO_STATE_INV_5:
                 switch_state_4_5();
                 ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 28 [SERVER SET STATE 5]");
                 state_change_reason=28; //Server set state 5
                 sss_start=1;
                 prev_sss=sss;
                 if(is_day_flag==NOW_NIGHT_TIME){
                    no_inh_flag=1; 
                 }
                 break;
            case ALGO_STATE_CHARG_INHIBIT_1:
                 algo_param.dev_algo_state = ALGO_STATE_CHARG_INHIBIT_1;
                 ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 29 [SERVER SET STATE 1]");
                 state_change_reason=29; //Server set state 1
                 no_frc_trip_flag = 1;
                 sss_start=1;
                 prev_sss=sss;
                 break;
            case ALGO_STATE_BAT_FRC_TRIP_4:
                 algo_param.dev_algo_state = ALGO_STATE_BAT_FRC_TRIP_4;
                 sss_start=1;
                 prev_sss=sss;
                 ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 31 [SERVER SET STATE 4]");
                 state_change_reason=31; //Server set state 4
                 prev_ft_count=frc_trip_count;
                 force_trip_pause_count = 0;
				 force_trip_pause_flag = 0;
                 ready_for_frc_trip = 1;
                 if(is_day_flag==NOW_NIGHT_TIME){
                    is_time_to_dynamic_ft_entry=1; 
                 }
                 break;
            case ALGO_STATE_SOL_CHG_3:
                 if(is_day_flag==NOW_DAY_TIME){
                  algo_param.dev_algo_state = ALGO_STATE_SOL_CHG_3;
                  sss_start=1;
                  ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 20 [SERVER SET STATE 3]");
                  state_change_reason=30; //Server set state 3
                  no_frc_trip_flag = 1;
                  prev_sss=sss;              
                  break;
                 }
                 else{
                    clear_common_flag(CF_SS);
                    i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);
                 }
                 break;
            case ALGO_STATE_BAT_SOL_FRC_TRIP_6:
                 if(is_day_flag==NOW_DAY_TIME){
                    algo_param.dev_algo_state = ALGO_STATE_BAT_SOL_FRC_TRIP_6;
                    sss_start=1;
                    ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 32 [SERVER SET STATE 6]");
                    state_change_reason=32; //Server set state 6
                    prev_sss=sss;
                    prev_ft_count=frc_trip_count;
                    frc_trip_count=0;
                    force_trip_pause_count = 0;
                    force_trip_pause_flag = 0;
                 }
                 else{
                    clear_common_flag(CF_SS);
                    i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);                  
                 }
                 break;
            case ALGO_STATE_SOL_INV_DIS_7:
                 if(is_day_flag==NOW_DAY_TIME){
                    // switch_state_4_7();
                     ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 33 [SERVER SET STATE 7]");
                    state_change_reason=33; //server set state 7
                    sss_start=1;
                    prev_sss=sss;
                    break;
                 }
                 else{
                    clear_common_flag(CF_SS);
                    i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);                     
                 }
        }
        state_change_status = 1;
        one_sec_log_time_out = 0;
    }
    
    if(sss_start==1)
    {
        if(++sss_start_dur>sssd)
        {
            sss_start_dur=0;
            sss_start=0;
            clear_common_flag(CF_SS);
            i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);
            ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 34 [SERVER SET TIME EXIT]");
            state_change_reason=34; //server set time exit
            switch(prev_sss)
            {
                case ALGO_STATE_INV_5:
                     switch_state_4_5();
                     if(is_day_flag==NOW_NIGHT_TIME)
                     {
                        no_inh_flag=0;
                     }
                     break;
                case ALGO_STATE_CHARG_INHIBIT_1:
                     no_frc_trip_flag = 0;
                     break;
                case ALGO_STATE_BAT_FRC_TRIP_4:
                     algo_param.dev_algo_state = ALGO_STATE_CHARG_INHIBIT_1;
                     frc_trip_count=prev_ft_count;
                     if(is_day_flag==NOW_NIGHT_TIME)
                     {
                       is_time_to_dynamic_ft_entry=0; 
                     }
                     break;
                case ALGO_STATE_SOL_CHG_3:
                     no_frc_trip_flag = 0;
                     break;
                case ALGO_STATE_BAT_SOL_FRC_TRIP_6:
                     algo_param.dev_algo_state = ALGO_STATE_CHARG_INHIBIT_1;
                     frc_trip_count=prev_ft_count;
                     break;
                case ALGO_STATE_SOL_INV_DIS_7:
                     algo_param.dev_algo_state = ALGO_STATE_INV_5;
                     break;
            }
            prev_sss=0;
            state_change_status = 1;
            one_sec_log_time_out = 0;
        }
    }
#endif
        /*Set the switch state*/
		turtle_set_sw(algo_param.dev_algo_state);
                
        if(one_sec_log_time_out==0)
        {
            if((prev_dev_state!=algo_param.dev_algo_state)&&(solar_cycling==0))
            {
                is_time_to_log=1;
                state_change_status=1;
            }
        }
        
