NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
        if(state_change_status)
        {
            one_sec_log_time_out++;
            if(one_sec_log_time_out>state_change_log_interval_duration_seconds)
            {
                is_time_to_log=0;
                one_sec_log_time_out=0;
                state_change_status=0;
            }
            else
            {
                is_time_to_log=1;
            }
        }
        /*To note the previous state*/
        prev_dev_state=algo_param.dev_algo_state;
	}
    else
    {
        if(algo_param.dev_algo_state != ALGO_STATE_INV_5)
        {
            if(is_sol_sensed==0)
            {
                ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 21 [SOLAR DISCONNECTED]");
                state_change_reason=21; //Solar disconnected
            }
            else
            {
                ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 22 [PAC ERROR]");
                state_change_reason=22; //PAC Error
            }
            switch_state_4_5();
            turtle_set_sw(algo_param.dev_algo_state);
        }
        clearOverVoltageFlag();
    }

	if((algo_param.dev_algo_state == ALGO_STATE_BAT_SOL_FRC_TRIP_6) ||(algo_param.dev_algo_state == ALGO_STATE_SOL_INV_DIS_7) ||(algo_param.dev_algo_state == ALGO_STATE_SOL_CHG_3))
	{
		bat_equ_param.equ_sol_sw_stat = 1;
	}
	else
	{
		bat_equ_param.equ_sol_sw_stat = 0;
	}
    
    if(solar_cycling)
    {
        if((algo_param.dev_algo_state == ALGO_STATE_BAT_SOL_FRC_TRIP_6) ||(algo_param.dev_algo_state == ALGO_STATE_SOL_INV_DIS_7) ||(algo_param.dev_algo_state == ALGO_STATE_SOL_CHG_3))
        {
             cycling_energy=(float)(pac_sol_p/3600);
             cycling_solar_present_time++;
        }
        else
        {
            cycling_solar_absent_time++;
        }
    }
	exception_flag = 0;
    // WDT_Fcn();
	turtle_set_sw(algo_param.dev_algo_state);
    show_led();
}

void
turtle_algorithm()
{
    static int high_temp_ft_exit_cnt = 0;
    float temp1 = 0.0;
    //ESP_LOGI(TAG,"Inside the turtle algorithm");
    show_led();
    // WDT_Fcn(); 
	check_time();
    if( (sunup_conf_enable == 0x01) && (is_day_flag == NOW_NIGHT_TIME)) {
        if(++timetosunup >= 300) {
           readyforsunup=0x01;
        }
    }
    xSemaphoreTake(i2cSemaphore,portMAX_DELAY);
	if(get_sensor_values(MV_AVG_ADC_VAL,1) == 1) {
		if(++pac_error_flag_cnt > 3) {
            pac_error_flag_cnt = 0;
		    pac_error_flag = 1;
        }
	}
    else{
        pac_error_flag = 0;
        pac_error_flag_cnt = 0;
    }
    xSemaphoreGive(i2cSemaphore);

    /* Adding new change as per Akhil's mail on Oct 03,2023 
     * If IO1 pin (TEMP1) value reaches 80 degree C, use single-press FT exit routine
     * and is called 'Temperature high exit algorithm
     */
     temp1 = get_temp1();
     //ESP_LOGI("TEMP_HIGH_EXIT_ALGO", "TEMPERATURE1 = %f \n",temp1);
     if(temp1 >= TEMP_HIGH_EXIT_THRESHOLD) {
         if(!force_trip_pause_flag) {
             ESP_LOGI("TEMP_HIGH_EXIT_ALERT", "TEMPERATURE1 reaches threshold..Exiting from FT \n");
             //high_temp_ft_exit_cnt++;
             //ESP_LOGI("TEMP_HIGH_EXIT_ALERT", "FT exiting count: %d\n",high_temp_ft_exit_cnt);
             pause_force_trip();
         }
     }
#if 1    
    if(mains_sense()){
        ESP_LOGI(TAG,"Mains sense High");
        if(++mains_sense_dur>2){
            mains_available=1;
        }
    }
    else{
        ESP_LOGI(TAG,"Mains sense Low");
        mains_sense_dur = 0;
        mains_available=0;
    }
#endif

	calc_summary();

    algo_interval_count++;

    if(prevent_solar_charging) {
        //if (++prevent_solar_charging_timeout>5){
        if (++prevent_solar_charging_timeout > 10) { // Changed to 10sec as per Akhil's suggestion
            /* code */
            prevent_solar_charging_timeout=0;
            prevent_solar_charging=0;
        }
    }

    if((sunup_conf_enable==0x01)&&(is_day_flag == NOW_NIGHT_TIME))
    {
       if(readyforsunup==0)
       {
           algo_param.cur_sol_v = 0.0;
       }
    }
    //Increment solar seconds
    solar_time_seconds++;
    //After one hour increment solar time
    if(solar_time_seconds>=3600)
    {
        //Reset solar seconds
        solar_time_seconds=0;
        //Increment solar time
        Solar_Time++;
        //If solar time is greater than 23
        if(Solar_Time>23)
        {
            //Reset solar time
            Solar_Time=23;
        }
    }

    /* No.of Modules Check*/
    /*If solar current is more than 40A stop solar charging *
     * This check is done to ensure that the no.of modules connected is not
     *  more than the requirement. Set the system to state 5*/
    if(algo_param.cur_sol_i>max_solar_current) {
#if DEBUG
        ESP_LOGI("DEBUG","CURRENT SOLAR I : %f, MAX_SOLAR_CURRENT: %f \n",algo_param.cur_sol_i,max_solar_current);
#endif
        is_time_to_log=1;
        stop_solar_chg=1;   
    }
    
    //bucket load power
    load_power_bucket[Solar_Time]+=(float)((pac_sol_p-sol_bat_p)/3600)+(pac_bat_dis_p/3600)+(ac_load_p/3600);
    
    if(device_state==ALGO_ON)
    {
            if(stop_solar_chg==1)
    		{
                if(++stop_solar_chg_cnt>1800)
                {
                    stop_solar_chg=0;
                }
                
        		if(algo_param.dev_algo_state != ALGO_STATE_INV_5)
        		{
                    ESP_LOGI("DEBUG_ALGO" , "Reason for state change : 26 [HIGH SOLAR CURRENT]");
                    state_change_reason=26; //High solar current
            		switch_state_4_5();
        		}
    		}
    		else{                      
    			if(Solar_Time<13){
               		solar_power_bucket[Solar_Time]+=(float)(pac_sol_p/3600);
            	}
            	Today_Recieved_Solar_Energy+=(float)(pac_sol_p/3600);
                state_change_algorithm();
            }
    }
    else
    {
        clearOverVoltageFlag();
        if(algo_param.dev_algo_state!=ALGO_STATE_INV_5)
        {
            switch_state_4_5(); 
        }
        show_led();
    }

