NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
    algo_param.cur_inv_v=inverter_vol;
    algo_param.state_change_reason=state_change_reason;
    algo_param.dev_stat=system_flag;
    algo_param.algo_stat=state_flag|(user_device_off<<15);
    algo_param.error=error_flag;
	if((algo_interval_count >= DEBUG_LOG_INTERVAL_DUR_SEC)){
		is_time_to_log = 1;
		algo_interval_count = 0; 
	}
    
    if(is_time_to_log){
		if( !test_error(ERR_RTC) && !test_error(ERR_NO_MEMORY) ) {
    		if(prev_hour != date_time->tm_hour){
                // https_req_buff_write(&https_request_buffer_body,get_information);
	    		algo_param.log_type = 1;
                ESP_LOGI(TAG,"Logging 1 hour data, log type: %d",algo_param.log_type);
                xSemaphoreTake(i2cSemaphore,portMAX_DELAY);
	    		log_to_eeprom();
                xSemaphoreGive(i2cSemaphore);
	    		one_hour_log_flag = 1;
	    		clear_summary();
	    	}

	    	if(turtle_log_available() > CONT_LOG_STOP_CNT) {
                ESP_LOGW(TAG,"turtle log available is greater than log stop count..");
    			debug_log_flag = 0;
                xSemaphoreTake(i2cSemaphore,portMAX_DELAY);
                state_change_log_interval_duration_seconds=(uint8_t) i2c_eeprom_read_byte(STATE_CHANGE_LOG_UNITS_NO_WIFI);
                xSemaphoreGive(i2cSemaphore);
    		} else {
    			debug_log_flag = 1;
                xSemaphoreTake(i2cSemaphore,portMAX_DELAY);
                state_change_log_interval_duration_seconds=(uint8_t) i2c_eeprom_read_byte(STATE_CHANGE_LOG_UNITS);
                xSemaphoreGive(i2cSemaphore);
    		}

            if(state_change_status) {
                algo_param.log_type = 4;
                ESP_LOGI(TAG, "Logging sensor data: log type: %d",algo_param.log_type);
                xSemaphoreTake(i2cSemaphore,portMAX_DELAY);
                log_to_eeprom();
                xSemaphoreGive(i2cSemaphore);
            } else if(debug_log_flag) {
	    		algo_param.log_type = 3;
                ESP_LOGI(TAG, "Logging sensor data: log type: %d",algo_param.log_type);
                xSemaphoreTake(i2cSemaphore,portMAX_DELAY);
	    		log_to_eeprom();
                xSemaphoreGive(i2cSemaphore);
    		}
    	}	    		
		is_time_to_log = 0;
    }

}

void calculate_utility_savings(void){
    if((algo_param.dev_algo_state!=5)&&(algo_param.dev_algo_state!=7)){
        if(dev_type==1){ algo_param.utility_savings += utility_saving_array[0]; };
        if(dev_type==2){ algo_param.utility_savings += utility_saving_array[1]; };
        if(dev_type==5){ algo_param.utility_savings += utility_saving_array[2]; };
        if(dev_type==6){ algo_param.utility_savings += utility_saving_array[3]; };
    }
    ESP_LOGI(TAG,"Utility savings is %f", algo_param.utility_savings);
}

void
calc_summary(){
    //The discharge current for last 3minutes is stored in an array
    absorption_current[abs_index]=algo_param.cur_dis_i;
    //Increment the element address
    abs_index += 1;
    //If the array gets filled the last value is stored in the first element of the array
    if(abs_index>=180){
        abs_index=0;
    }
    //The SOC of the battery is calculated by adding the previous SOC with the battery charging current  and subtracting the total with the discharge current
    //The battery charging current and discharge currents are converted into AH by dividing it by 3600
    Bat_SOC = Bat_SOC+(algo_param.cur_bat_v*(algo_param.cur_chg_i-algo_param.cur_dis_i)/3600);
    //If the AH goes beyond the rated battery AH the rated AH is set as the current SOC
    //SOC is calculated in terms of AH
    Bat_DoD = total_bat_capacity - Bat_SOC;
    
    if(Bat_SOC>(total_bat_capacity))
    {
        Bat_SOC=total_bat_capacity; //If SOC goes beyond rated AH it is reset
    }
    
    if(Bat_SOC<(0.5*total_bat_capacity))
    {
        battery_low = 1;
    }
    else
    {
        battery_low = 0;
    }
    
    calculate_utility_savings();
    //Before sending to the server the SOC is converted into percentage of the rated AH
    algo_param.bat_cur_cap_coul = (Bat_SOC/(total_bat_capacity))*100;  
	algo_param.sol_e += pac_sol_p;
	algo_param.sol_bat_e += sol_bat_p;
	algo_param.bat_dis_e += pac_bat_dis_p;
	algo_param.bat_ac_chg_e += mains_chg_p;
	algo_param.ac_load_e += ac_load_p;
	algo_param.num_sum_samples++;
}



void 
clear_summary()
{
	algo_param.sol_e = 0;
	algo_param.sol_bat_e = 0;
	algo_param.bat_dis_e = 0;
	algo_param.bat_ac_chg_e = 0;
	algo_param.ac_load_e = 0;
	algo_param.num_sum_samples = 0;	
	prev_hour = date_time->tm_hour;
    algo_param.utility_savings = 0.0;
    https_req_buff_write(&https_request_buffer_body,get_information);
//#warning "load previous hour here"	
}

void check_battery_voltage(){
    float batVol;
    xSemaphoreTake(i2cSemaphore,portMAX_DELAY);
    batVol = getBatteryVoltage();
    xSemaphoreGive(i2cSemaphore);
    
    if(  batVol > bat_max_v ){
        
        ESP_LOGI(TAG,"Battery value above set threshold");
        prevent_solar_charging_of_device();
        solar_equ_cnt+=1;
        bat_full_flag = 1; //Battery full flag status set
        Bat_SOC=total_bat_capacity;
        exception_flag = 1; //Exception flag for data log
        if(algo_param.dev_algo_state == ALGO_STATE_BAT_SOL_FRC_TRIP_6){ //If state is 6 change to 4
            algo_param.dev_algo_state = ALGO_STATE_BAT_FRC_TRIP_4;
        }
        else if(algo_param.dev_algo_state == ALGO_STATE_SOL_INV_DIS_7){ //If state is 7 change to 5
            mains_sol_chg_flag=0;
            if(test_system_flag(SF_SMC))
            {
                clear_system_flag(SF_SMC);
            }
            algo_param.dev_algo_state = ALGO_STATE_INV_5;
        }
        else if(algo_param.dev_algo_state == ALGO_STATE_SOL_CHG_3){ //If state is 3 change to 1
            algo_param.dev_algo_state = ALGO_STATE_CHARG_INHIBIT_1;
        }
        bat_equ_param.equ_sol_sw_stat = 0;
        sol_mos_sw_off();
        ESP_LOGI(TAG,"Solar switch off");
        solar_cycling=1;          
    }      
}


/** 
 ** Initialize the algorithm
 ** Read calibration constants from memory
 ** Flush the moving average buffer
 ** Arguments :
 **  None
 ** Reurns :
 **  None
**/
void init_algo(){
    i2c_eeprom_read_buff(EE_DEV_SER_NO_ADDR,(uint8_t *)dev_id,DEV_SER_NO_LEN);
	algo_interval_count = 0;
	force_trip_pause_flag = 0;
	force_trip_pause_count = 0;
	power_trip_flag = 0;
	bat_sol_equ_intr_cnt = 0;
    bat_sol_equ_dur_cnt = 0;
    no_sol_check_count = 0;
    is_time_to_equ = 0;
	is_sol_sensed = 0;
	no_inh_flag = 0;
	peak_inh_flag = 0;
	no_frc_trip_flag = 0;
	is_day_flag = NOW_NIGHT_TIME;
	low_sol_flag = 0; 
	dc_over_load_flag = 0;
	dc_under_load_flag = 0;
	low_sol_check_count = 0;
	sol_v_chk_count = 0;
	over_load_check_count = 0;
	under_load_check_count = 0;
	need_solar_mains_top_up = 0;
	mains_topup_count = 0;
	ready_for_frc_trip = 0;
	mains_chg_flag = 0;
	pac_error_flag = 0;
    pac_error_flag_cnt = 0;
	exception_flag = 0;
	frc_trip_count = 0;
	bat_full_flag = 0;
    debug_log_flag = 1;
    is_time_to_log = 0;
    algo_interval_count = 0; 
    soc_reset_flag = 0;
    algo_param.bat_cur_cap_coul = 0;
    algo_param.cur_temp = 0;
    //init_pac1720(); //Initialize PAC //VINEETH
	load_sensor_constants();
	get_sensor_values(FLUSH_ADC_VAL, 0);
	algo_param.dev_algo_state = ALGO_STATE_INV_5;
	turtle_set_sw(algo_param.dev_algo_state);
	clear_summary();
	bat_equ_param.equ_sol_sw_stat = 0;
    Previous_Day_Sundown=12;
    Previous_Day_Morning_Sunhour=6;
    reset_parameters();
}



