NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
void load_sensor_constants(){
	pac_bat_v_const = i2c_eeprom_read_float(EE_PAC_BAT_V_CONST_ADDR);
	uc_bat_v_const = i2c_eeprom_read_float(EE_UC_BAT_V_CONST_ADDR);
	pac_bat_chg_i_const = i2c_eeprom_read_float(EE_PAC_BAT_CHG_I_CONST_ADDR);
    pac_bat_dis_i_const = i2c_eeprom_read_float(EE_PAC_BAT_DIS_I_CONST_ADDR);
    pac_bat_chg_i_offset = i2c_eeprom_read_float(EE_PAC_BAT_CHG_I_OFF_ADDR);
    pac_bat_dis_i_offset = i2c_eeprom_read_float(EE_PAC_BAT_DIS_I_OFF_ADDR);
	pac_bat_p_const = i2c_eeprom_read_float(EE_PAC_BAT_P_CONST_ADDR);
	pac_sol_v_const = i2c_eeprom_read_float(EE_PAC_SOL_V_CONST_ADDR);
	uc_sol_v_const = i2c_eeprom_read_float(EE_UC_SOL_V_CONST_ADDR);
	pac_sol_i_const = i2c_eeprom_read_float(EE_PAC_SOL_I_CONST_ADDR);
    pac_sol_i_const = pac_sol_i_const/2; // HACK FOR EEPROM pac_sol_i_const value
    pac_sol_i_offset = i2c_eeprom_read_float(EE_PAC_SOL_I_OFF_ADDR);
	pac_sol_p_const = i2c_eeprom_read_float(EE_PAC_SOL_P_CONST_ADDR);
	ct_load_i_offset = i2c_eeprom_read_int16(EE_CT_LOAD_I_OFST_ADDR);
	ct_load_i_const = i2c_eeprom_read_float(EE_CT_LOAD_I_CONST_ADDR);
    uc_temp1_const = i2c_eeprom_read_float(EE_UC_TEMP1_CONST_ADDR);
    uc_temp2_const = i2c_eeprom_read_float(EE_UC_TEMP2_CONST_ADDR);
	max_dc_load_i = i2c_eeprom_read_float(EE_DC_OVER_I_THR_ADDR);
	max_ac_load_i = i2c_eeprom_read_float(EE_AC_OVER_I_THR_ADDR);
    battery_type = i2c_eeprom_read_byte(EE_BAT_TYPE_ADDR);
    dev_type=i2c_eeprom_read_byte(EE_DEVICE_TYPE_ADDR);
	bat_max_v = i2c_eeprom_read_float(EE_BAT_MAX_VOLT_ADDR);
#ifdef DEBUG
    // Logging sensor constants for Debugging purpose 
    ESP_LOGI("-----","----------------------------------");
    ESP_LOGI("DEBUG"," pac_bat_v_const: %f \n",pac_bat_v_const);
    ESP_LOGI("DEBUG"," uc_bat_v_const: %f \n",uc_bat_v_const);
    ESP_LOGI("DEBUG"," pac_bat_chg_i_const: %f \n",pac_bat_chg_i_const);
    ESP_LOGI("DEBUG"," pac_bat_dis_i_const: %f \n",pac_bat_dis_i_const);
    ESP_LOGI("DEBUG"," pac_bat_chg_i_offset: %f \n",pac_bat_chg_i_offset);
    ESP_LOGI("DEBUG"," pac_bat_dis_i_offset: %f \n",pac_bat_dis_i_offset);
    ESP_LOGI("DEBUG"," pac_bat_p_const: %f \n",pac_bat_p_const);
    ESP_LOGI("DEBUG"," pac_sol_v_const: %f \n",pac_sol_v_const);
    ESP_LOGI("DEBUG"," uc_sol_v_const: %f \n",uc_sol_v_const);
    ESP_LOGI("DEBUG"," pac_sol_i_const: %f \n",pac_sol_i_const);
    ESP_LOGI("DEBUG"," pac_sol_i_offset: %f \n",pac_sol_i_offset);
    ESP_LOGI("DEBUG"," pac_sol_p_const: %f \n",pac_sol_p_const);
    ESP_LOGI("DEBUG"," ct_load_i_offset: %d \n",ct_load_i_offset);
    ESP_LOGI("DEBUG"," ct_load_i_const: %f \n",ct_load_i_const);
    ESP_LOGI("DEBUG"," uc_temp1_const: %f \n",uc_temp1_const);
    ESP_LOGI("DEBUG"," uc_temp2_const: %f \n",uc_temp2_const);
    ESP_LOGI("DEBUG"," max_dc_load_i: %f \n",max_dc_load_i);
    ESP_LOGI("DEBUG"," max_ac_load_i: %f \n",max_ac_load_i);
    ESP_LOGI("DEBUG"," battery_type: %d \n",battery_type);
    ESP_LOGI("DEBUG","dev_type: %d \n",dev_type);
    ESP_LOGI("DEBUG","bat_max_v: %f \n",bat_max_v);
    ESP_LOGI("-----","----------------------------------");
#endif
    extern PPAC194X5X_DEVICE_CONTEXT pPACdevice;

    if((dev_type==1)||(dev_type==5)){
        PAC194x5x_SetOverVolt_limit(pPACdevice, 15.0);
    }
    else{
        if((dev_type==2)||(dev_type==6)){
            PAC194x5x_SetOverVolt_limit(pPACdevice, 29.0);
        }
    }
    
    Rated_Bat_AH = i2c_eeprom_read_float(EE_BAT_CAP_ADDR);
    bat_age = i2c_eeprom_read_byte(EE_BAT_AGE_ADDR);
    dev_state_flag=i2c_eeprom_read_byte(DEV_SYS_FLAG);
    eve_soc_corr=i2c_eeprom_read_float(EVE_BAT_SOC_COR_LOW_LIM);
    night_soc_corr=i2c_eeprom_read_float(EVE_BAT_SOC_COR_HIGH_LIM);
    if(dev_state_flag&Bit(2)){    
        bat_frc_trip_exit_v_thr = i2c_eeprom_read_float(VFT_EXT_THR);
    }
    else{
        bat_frc_trip_exit_v_thr = i2c_eeprom_read_float(EE_BAT_FRC_EXIT_VOLT_ADDR);
    }
    bat_vol=i2c_eeprom_read_float(EE_BAT_FRC_EXIT_VOLT_ADDR);
    max_frc_per_day = i2c_eeprom_read_byte(EE_FT_NUM_ADDR);
    total_bat_capacity=bat_vol*Rated_Bat_AH;
    sol_inst = i2c_eeprom_read_float(EE_SOL_CAP)*1000.0;
    if(dev_state_flag&Bit(2)){
        bat_mains_chg_in_v_thr = bat_frc_trip_exit_v_thr-0.2;    
	}
    else{
        bat_mains_chg_in_v_thr = i2c_eeprom_read_float(EE_BAT_MAINS_CHG_IN_VOLT_ADDR);
    }
    if(dev_state_flag&Bit(1)){
        weight1=(float)i2c_eeprom_read_float(DAILY_LOAD_THR);
        weight2=1.0-weight1;
    }
    else{
        if(dev_state_flag&Bit(2)){
            weight1=(float)i2c_eeprom_read_float(WEEKLY_LOAD_THR);
            weight2=1.0-weight1;
        }
        else{
            weight1=0.75;
            weight2=1.0-weight1;
        }
    }
#if DEBUG
    ESP_LOGI("-----","----------------------------------");
    ESP_LOGI("DEBUG","Rated_Bat_AH: %f \n",Rated_Bat_AH);
    ESP_LOGI("DEBUG","bat_age: %d \n",bat_age);
    ESP_LOGI("DEBUG","dev_state_flag: %d \n",dev_state_flag);
    ESP_LOGI("DEBUG","eve_soc_corr: %f \n",eve_soc_corr);
    ESP_LOGI("DEBUG","night_soc_corr: %f \n",night_soc_corr);
    ESP_LOGI("DEBUG","bat_frc_trip_exit_v_thr: %f \n",bat_frc_trip_exit_v_thr);
    ESP_LOGI("DEBUG","bat_vol: %f \n",bat_vol);
    ESP_LOGI("DEBUG","max_frc_per_day: %d \n",max_frc_per_day);
    ESP_LOGI("DEBUG","sol_inst: %f \n",sol_inst);
    ESP_LOGI("DEBUG","bat_mains_chg_in_v_thr: %f \n",bat_mains_chg_in_v_thr);
    ESP_LOGI("DEBUG","weight1: %f \n",weight1);
    ESP_LOGI("-----","----------------------------------");
#endif
    sss=i2c_eeprom_read_byte(SER_ASSERT_STATE);
    sssd=i2c_eeprom_read_int16(SER_STATE_ASSERTED_DUR);
    sath=i2c_eeprom_read_byte(SER_STATE_ASSERTED_TIM_HR);
    satm=i2c_eeprom_read_byte(SER_STATE_ASSERTED_TIM_MIN);
    common_flag|=i2c_eeprom_read_int16(COMMON_THR);
    sss_time=(uint32_t)((uint32_t)(satm*60)+(uint32_t)(sath*3600));
    bat_mains_chg_out_v = i2c_eeprom_read_float(EE_BAT_MAINS_CHG_OUT_VOLT_ADDR);
	morn_chg_inh_flag = i2c_eeprom_read_byte(EE_MORN_CHG_INH_EN_ADDR);
	even_chg_inh_flag = i2c_eeprom_read_byte(EE_EVEN_CHG_INH_EN_ADDR);
    bat_abs_intr = i2c_eeprom_read_int16(EE_ABS_INTR_ADDR);
	bat_sol_equ_intr = i2c_eeprom_read_byte(EE_BAT_EQU_INTR_ADDR);
	bat_sol_equ_dur = (uint16_t) i2c_eeprom_read_byte(EE_BAT_EQU_DUR_ADDR) * (uint16_t) 3600;
	bat_max_volt_adc = 	(uint16_t)(bat_max_v/uc_bat_v_const);
	bat_sol_con_v = (bat_max_v - SOL_RECON_OFFSET);
    state_change_log_interval_duration_seconds=i2c_eeprom_read_byte(STATE_CHANGE_LOG_UNITS);
    useabe_SoC_start_time = (uint8_t) i2c_eeprom_read_byte(USEABLE_SOC_STRT);
    max_solar_current = (float) i2c_eeprom_read_float(SOL_MAX_CUR);
    ft_entry_start_day=i2c_eeprom_read_byte(FT_ENTRY_STRT_DAY);
    ft_exit_start_day=i2c_eeprom_read_byte(FT_EXIT_STRT_DAY);
    useable_soc_recal_dur=180;
    VFT_Exit_Higher=bat_vol*i2c_eeprom_read_float(VFT_EXIT_HIGH);
    VFT_Exit_Lower=bat_vol*i2c_eeprom_read_float(VFT_EXIT_LOW);
    abs_mains_fail_tolerance=(uint16_t)i2c_eeprom_read_byte(DEV_ABS_MF_PER)*(uint16_t)3600;
    equ_fail_tolerance=(uint16_t)i2c_eeprom_read_byte(EQ_MF_PER)*(uint16_t)3600;
#if DEBUG
    ESP_LOGI("-----","----------------------------------");
    ESP_LOGI("DEBUG","bat_mains_chg_out_v: %f \n",bat_mains_chg_out_v);
    ESP_LOGI("DEBUG","max_solar_current: %f \n",max_solar_current);
    ESP_LOGI("-----","----------------------------------");
#endif
    if(dev_state_flag&Bit(2)){
        useable_SOC1=i2c_eeprom_read_float(USEABLE_SOC);
    }
    else{
        useable_SOC1=(total_bat_capacity)/(2.0*(1.0+bat_age*0.5));
    }
    useable_soc_multiplier=i2c_eeprom_read_float(DEV_USEABLE_SOC_MULTIPLIER);
    equ_hys=(float)((float)bat_vol/((float)i2c_eeprom_read_byte(DEV_EQU_HYS)));
    useable_bat_frc_trip_exit_v=bat_vol-(bat_vol/15.0);
    bat_voltage_settable=bat_max_v;
    server_ft_exit_time=i2c_eeprom_read_int16(FT_EXIT_TIM);
    
    if(test_common_flag(CF_SOL_CR)){
        MA_Morning_Solar_Bucket=(float) i2c_eeprom_read_float(MORN_SOL_PRED);
        MA_Afternoon_Solar_Bucket=(float) i2c_eeprom_read_float(EVEN_SOL_PRED);
        clear_common_flag(CF_SOL_CR);
        i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);
    }
    
    if(test_common_flag(CF_SOL_E_UPD)){
        Day_Morning_Solar_Bucket[0]=(float) i2c_eeprom_read_float(DAY1_MORN_SOL);
        Day_Morning_Solar_Bucket[1]=(float) i2c_eeprom_read_float(DAY2_MORN_SOL);
        Day_Morning_Solar_Bucket[2]=(float) i2c_eeprom_read_float(DAY3_MORN_SOL);
        MA_Morning_Solar_Bucket=(Day_Morning_Solar_Bucket[0]+Day_Morning_Solar_Bucket[1]+Day_Morning_Solar_Bucket[2])/3;
        Day_Afternoon_Solar_Bucket[0]=(float) i2c_eeprom_read_float(DAY1_AFT_SOL);
        Day_Afternoon_Solar_Bucket[1]=(float) i2c_eeprom_read_float(DAY2_AFT_SOL);
        Day_Afternoon_Solar_Bucket[2]=(float) i2c_eeprom_read_float(DAY3_AFT_SOL);
        MA_Afternoon_Solar_Bucket=(Day_Afternoon_Solar_Bucket[0]+Day_Afternoon_Solar_Bucket[1]+Day_Afternoon_Solar_Bucket[2])/3;
        clear_common_flag(CF_SOL_E_UPD);
        i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);
    }
    
    if(test_common_flag(CF_LOAD_E_UPD))
    {
        Day_Morning_Load_Bucket[0]=(float) i2c_eeprom_read_float(DAY1_MORN_LOAD);
        Day_Morning_Load_Bucket[1]=(float) i2c_eeprom_read_float(DAY2_MORN_LOAD);
        Day_Morning_Load_Bucket[2]=(float) i2c_eeprom_read_float(DAY3_MORN_LOAD);
        Day_Morning_Load_Bucket[3]=(float) i2c_eeprom_read_float(DAY4_MORN_LOAD);
        Day_Morning_Load_Bucket[4]=(float) i2c_eeprom_read_float(DAY5_MORN_LOAD);
        Day_Morning_Load_Bucket[5]=(float) i2c_eeprom_read_float(DAY6_MORN_LOAD);
        Day_Morning_Load_Bucket[6]=(float) i2c_eeprom_read_float(DAY7_MORN_LOAD);
        
