NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
        Day_Night_Load_Bucket[0]=(float) i2c_eeprom_read_float(DAY1_NGT_LOAD);
        Day_Night_Load_Bucket[1]=(float) i2c_eeprom_read_float(DAY2_NGT_LOAD);
        Day_Night_Load_Bucket[2]=(float) i2c_eeprom_read_float(DAY3_NGT_LOAD);
        Day_Night_Load_Bucket[3]=(float) i2c_eeprom_read_float(DAY4_NGT_LOAD);
        Day_Night_Load_Bucket[4]=(float) i2c_eeprom_read_float(DAY5_NGT_LOAD);
        Day_Night_Load_Bucket[5]=(float) i2c_eeprom_read_float(DAY6_NGT_LOAD);
        Day_Night_Load_Bucket[6]=(float) i2c_eeprom_read_float(DAY7_NGT_LOAD);
        
        clear_common_flag(CF_LOAD_E_UPD);
        i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);
    }
    
    if(test_common_flag(CF_DAY))
    {
        num_days = (uint16_t) i2c_eeprom_read_int16(NUM_DAYS);
        clear_common_flag(CF_DAY);
        i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);   
    }

}

void reset_parameters(void){
        extern uint8_t stopBatteryOverVoltageProtectionOnCalibration;
        stopBatteryOverVoltageProtectionOnCalibration=0;
        early_ft_entry=0;
        enable_early_ft_entry=0;
        battery_type = i2c_eeprom_read_byte(EE_BAT_TYPE_ADDR);
        num_days=0;
        is_day_flag = NOW_NIGHT_TIME;
        Solar_Time=0;
        solar_time_seconds=0;
        total_time=0;
        system_flag=0;
        state_flag=0;
        prevent_solar_charging=0;
        prevent_solar_charging_timeout=0;
        for(int i=0;i<12;i++)
        {
            solar_power_bucket[i]=0.0;
        }
        Today_Recieved_Solar_Energy=0.0;
        for(int i=0;i<24;i++)
        {
            load_power_bucket[i]=0.0;
        }
                
        for(int i=0;i<20;i++)
        {
            load.log_SOC[i]=0.0;
            load.log_voltage[i]=0.0;
            load.log_current[i]=0.0;
        }
        for(int i=0;i<5;i++)
        {
            load.date_time[i]=0;
        }
        Bat_SOC=0.0;
        estimated_ft_entry_time=0;
        check_ft_entry_time=0;      
        /* If useable SoC is calculated already we skip the initialization routine */ 
        if(!(dev_state_flag&Bit(2)))
        {
            if(bat_age==0)
            {
                post_system_flag(SF_ABS_NEEDED);  
            }
            else
            {
                post_system_flag(SF_USEABLE_SOC_CAL); 
            }
        }
        else
        {
            post_system_flag(SF_ABS_NEEDED);
        }
        Previous_Day_Morning_Sunhour=6;
        Previous_Day_Sundown=12;
        soc_reset_flag = 0;
        
        if((is_time_to_cal_useable_soc))
        {
            frc_trip_count=0;
            is_time_to_cal_useable_soc=0;
            re_cal_useable_soc_count++;
            if(re_cal_useable_soc_count>1)
            {
                enable_cal_useable_soc=0;
                need_eq_after_abs=0;
                post_system_flag(SF_USEABLE_SOC_FAILED);
                re_cal_useable_soc_count=0;
            }
            else
            {
                ft_exit_start_day++;
                ft_entry_start_day++;
                post_system_flag(SF_USEABLE_SOC_CAL);
            }
        }
}

/** 
 ** When a single press detectected exit from forcetrip
 ** and will not try for a forcetrip for next 30 min
 ** Arguments :
 **  None
 ** Reurns :
 **  None
**/
void
pause_force_trip(){
	if((algo_param.dev_algo_state == ALGO_STATE_BAT_FRC_TRIP_4) || \
		(algo_param.dev_algo_state == ALGO_STATE_BAT_SOL_FRC_TRIP_6))
	{
		// algo_param.dev_algo_state = ALGO_STATE_INV_5;
        if(is_time_to_dynamic_ft_entry)
        {
            if(is_day_flag==NOW_NIGHT_TIME)
            {
                dynamic_ft_complete=1;
            }
            is_time_to_dynamic_ft_entry=0;
        }
		// turtle_set_sw(algo_param.dev_algo_state);
	}

	force_trip_pause_flag = 1;
	force_trip_pause_count = 0;
	frc_trip_count++;
}

void singlePressEffectOnAlgorithm(void){
  state_change_reason = Bit(6);
  if(test_system_flag(SF_INV_FAIL)){
    clear_system_flag(SF_INV_FAIL);
  }
  if((is_time_to_cal_useable_soc)){
      frc_trip_count=0;
      is_time_to_cal_useable_soc=0;
      re_cal_useable_soc_count++;
      if(re_cal_useable_soc_count>1){
          enable_cal_useable_soc=0;
          need_eq_after_abs=0;
          post_system_flag(SF_USEABLE_SOC_FAILED);
          re_cal_useable_soc_count=0;
      }
      else{
          ft_exit_start_day++;
          ft_entry_start_day++;
          post_system_flag(SF_USEABLE_SOC_CAL);
      }
  }
  beep(1,SHORT_BEEP);
  pause_force_trip();
  beep(1,LONG_BEEP);
}

void Solar_Energy_Bucketing(){
        Morning_Solar_Bucket=0.0;
        for(int i=0;i<Morning_Sunhour;i++){    
            Morning_Solar_Bucket=Morning_Solar_Bucket+solar_power_bucket[i];
        }      
        Afternoon_Solar_Bucket=0.0;
        for(int i=Morning_Sunhour;i<=Sundown_Time;i++){    
            Afternoon_Solar_Bucket=Afternoon_Solar_Bucket+solar_power_bucket[i];
        }
        Day_Morning_Solar_Bucket[0]=Day_Morning_Solar_Bucket[1];
        Day_Morning_Solar_Bucket[1]=Day_Morning_Solar_Bucket[2];
        Day_Morning_Solar_Bucket[2]=Morning_Solar_Bucket;
        MA_Morning_Solar_Bucket=(Day_Morning_Solar_Bucket[0]+Day_Morning_Solar_Bucket[1]+Day_Morning_Solar_Bucket[2])/3;
        Day_Afternoon_Solar_Bucket[0]=Day_Afternoon_Solar_Bucket[1];
        Day_Afternoon_Solar_Bucket[1]=Day_Afternoon_Solar_Bucket[2];
        Day_Afternoon_Solar_Bucket[2]=Afternoon_Solar_Bucket;
        MA_Afternoon_Solar_Bucket=(Day_Afternoon_Solar_Bucket[0]+Day_Afternoon_Solar_Bucket[1]+Day_Afternoon_Solar_Bucket[2])/3;
        reset_solar_power_bucket();
}

void reset_solar_power_bucket(){
    for(int i=0;i<12;i++){
        solar_power_bucket[i]=0.0;
    }
    Morning_Solar_Bucket=0.0;
    Afternoon_Solar_Bucket=0.0;
}

void reset_load_power_bucket(){
    for(int i=0;i<24;i++){
        load_power_bucket[i]=0.0;
    }
    Day_Load_Bucket=0.0;
    Night_Load_Bucket=0.0;
}
void Load_Energy_Bucketing(){
        Day_Load_Bucket=0.0;
        for (int i = 0; i < Sundown_Time; i++){
			Day_Load_Bucket=Day_Load_Bucket+load_power_bucket[i];
		}

        Night_Load_Bucket=0.0;
		for (int i = Sundown_Time+6; i <= 23; i++){
			Night_Load_Bucket=Night_Load_Bucket+load_power_bucket[i];
		}
		Day_Morning_Load_Bucket[0]=Day_Morning_Load_Bucket[1];
        Day_Morning_Load_Bucket[1]=Day_Morning_Load_Bucket[2];
        Day_Morning_Load_Bucket[2]=Day_Morning_Load_Bucket[3];
        Day_Morning_Load_Bucket[3]=Day_Morning_Load_Bucket[4];
        Day_Morning_Load_Bucket[4]=Day_Morning_Load_Bucket[5];
        Day_Morning_Load_Bucket[5]=Day_Morning_Load_Bucket[6];
        Day_Morning_Load_Bucket[6]=Day_Load_Bucket;      
        Day_Night_Load_Bucket[0]=Day_Night_Load_Bucket[1];
        Day_Night_Load_Bucket[1]=Day_Night_Load_Bucket[2];
        Day_Night_Load_Bucket[2]=Day_Night_Load_Bucket[3];
        Day_Night_Load_Bucket[3]=Day_Night_Load_Bucket[4];
        Day_Night_Load_Bucket[4]=Day_Night_Load_Bucket[5];
        Day_Night_Load_Bucket[5]=Day_Night_Load_Bucket[6];
        Day_Night_Load_Bucket[6]=Night_Load_Bucket;
        reset_load_power_bucket();
}

void Dynamic_FT_Exit_Algorithm(){
    //Only if Dynamic_FT_Exit_Enable is set the algorithm works
    //For the first 4 days the dynamic algorithm doesn't work
    //When useable SOC is to be calculated the algorithm won't work
    if(Dynamic_FT_Exit_Enable){//Solar Bucketing Code
        if((Previous_Day_Morning_Sunhour<=Solar_Time)&&(Correction_Factor_Enable==0)){
            Correction_Factor=((MA_Afternoon_Solar_Bucket/MA_Morning_Solar_Bucket)*Today_Recieved_Solar_Energy)+Today_Recieved_Solar_Energy;
            Correction_Factor_Enable=1;
        }

