NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
        if(Correction_Factor_Enable){
            if((Correction_Factor-Today_Recieved_Solar_Energy-(SOC_Error*SOC_Err_Inc))<=((total_bat_capacity)-Bat_SOC)){
                Dynamic_FT_Exit=1;
                Correction_Factor_Enable=0;
            }
        }
        
        if(test_common_flag(CF_FT_EXIT)){
            if(total_time>server_ft_exit_time){
               Dynamic_FT_Exit=1; 
            }
        }
    }
}

uint32_t  
Dynamic_FT_Entry_Time_Calculate(){
    //This algorithm works only when the dynamic ft entry enable flag is set
    //The flag will be reset during absorption days
    if(Dynamic_FT_Entry_Enable){
        if(dev_state_flag&Bit(0)){
            //The morning load and evening load will be predicted
            //This section predicts considering the previous week same day load and average of the last week load.
            B1=0.75*Day_Morning_Load_Bucket[0]+0.25*((Day_Morning_Load_Bucket[1]+Day_Morning_Load_Bucket[2]+Day_Morning_Load_Bucket[3]+Day_Morning_Load_Bucket[4]+Day_Morning_Load_Bucket[5]+Day_Morning_Load_Bucket[6])/6);
            B2=0.75*Day_Night_Load_Bucket[0]+0.25*((Day_Night_Load_Bucket[1]+Day_Night_Load_Bucket[2]+Day_Night_Load_Bucket[3]+Day_Night_Load_Bucket[4]+Day_Night_Load_Bucket[5]+Day_Night_Load_Bucket[6])/6);
        }
        else{            
            //This sections predicts considering previous week same day load and yesterday's load
            B1=0.75*Day_Morning_Load_Bucket[0]+0.25*Day_Morning_Load_Bucket[6];
            B2=0.75*Day_Night_Load_Bucket[0]+0.25*Day_Night_Load_Bucket[6];
        }

        //Depth of discharge is calculated along with an AH efficiency        
        C2=(((total_bat_capacity)-Bat_SOC))/AH_Efficiency;

        //If the morning and afternoon bucket of next day is greater than the night load and depth of discharge estimated
        if((MA_Morning_Solar_Bucket+MA_Afternoon_Solar_Bucket)>(B1+C2)){
            //Calculate the FT constant which will be used in estimating the ft entry time
            if((MA_Morning_Solar_Bucket+MA_Afternoon_Solar_Bucket-B1-C2)>useable_SOC1){
                FT_Constant=(useable_SOC1/B2);
            }
            else{
                if((MA_Morning_Solar_Bucket+MA_Afternoon_Solar_Bucket-B1-C2)>B2){
                    FT_Constant=1.0;
                }
                else{
                    FT_Constant=(B2-(MA_Morning_Solar_Bucket+MA_Afternoon_Solar_Bucket-B1-C2))/B2;
                }
            }
            //Enable ready to frc trip flag
            ready_for_frc_trip=1;
            //Reset no force trip flag
            no_frc_trip_flag=0;
            //Enable ft entry
            Dynamic_FT_Enter=1;
            //FT entry time is calculated based on FT_constant

            if(FT_Constant>=1.0)
            {
                FT_Constant=1.0;
            }

            //FT_Entry_Time=(uint32_t)((24.0-(7.0*FT_Constant))*(float)3600);
            FT_Entry_Time=(uint32_t) ((((float)Sundown_Time+(float)6.0)+((float)6.0*(float)(1.0-FT_Constant)))*(float)3600);
        }
        else
        {
            Dynamic_FT_Enter=0;
#if 1
            if((Bat_SOC>0.95*(total_bat_capacity))&&(solar_equ_cnt>3600))
            {
                FT_Constant=(useable_SOC1/B2);
                //Enable ready to frc trip flag
                    ready_for_frc_trip=1;
                //Reset no force trip flag
                    no_frc_trip_flag=0;
                //Enable ft entry
                    Dynamic_FT_Enter=1;
                //FT entry time is calculated based on FT_constant

                if(FT_Constant>=1.0)
                {
                    FT_Constant=1.0;
                }

                //FT_Entry_Time=(uint32_t)((24.0-(7.0*FT_Constant))*(float)3600);
                FT_Entry_Time=(uint32_t) ((((float)Sundown_Time+(float)6.0)+((float)6.0*(float)(1.0-FT_Constant)))*(float)3600);
                
            }
            else
            {
                Dynamic_FT_Enter=0;
            }
#endif
        }
    }
        if(Dynamic_FT_Enter==0)
        {
            return 0;
        }
        else
        {
            return FT_Entry_Time;
        }
}

void 
Dynamic_FT_Entry_Algorithm()
{
    
    if((total_time>estimated_ft_entry_time)&&(Dynamic_FT_Enter==1))
    {
        check_ft_entry_time=Dynamic_FT_Entry_Time_Calculate();
                
        if((check_ft_entry_time-estimated_ft_entry_time)>600)
        {
            Dynamic_FT_Enter=1;
            estimated_ft_entry_time=check_ft_entry_time;
        }
        else
        {
            is_time_to_dynamic_ft_entry=1;
            ready_for_frc_trip=1;
            Dynamic_FT_Enter=0;
        }
    }
}

void 
sun_down_routine()
{
        sundown_count=0;
        solar_cycling=0;
        mains_sol_chg_flag=0;
        if(test_system_flag(SF_SMC))
        {
         clear_system_flag(SF_SMC);
        }
        mains_chg_flag=0;
        Sundown_Time=Solar_Time;
        
        
        Morning_Sunhour=Sundown_Time/2;
        
        if(num_days>1)
        {
            Previous_Day_Sundown=Sundown_Time;
            Previous_Day_Morning_Sunhour=Morning_Sunhour;
        }

        /*The variable indicates the day or night time of the day*/
            is_day_flag = NOW_NIGHT_TIME;
        /*Total solar received for the day is reset*/
            Today_Recieved_Solar_Energy=0;

        /*Solar value collected during the day is bucketed into morning and evening slots*/

        if((num_days>=2)&&!(dev_state_flag&Bit(5)))
        {
            Solar_Energy_Bucketing();
        }
        /*Variables assigned to stop the force trip are reset*/    
            no_frc_trip_flag = 0;
            frc_trip_count = 0;

        /*This condition happens during the first day of installation or when a useable SOC mismatch happens*/
        /*When the SF_USEABLE_SOC_CAL flag is set. The device is pushed into absorption. Equalization is done on the next day*/
        /*Once absorption and equalization is complete the battery is evacuated to estimate the useable SOC*/
            if((++useable_soc_recal_cnt>useable_soc_recal_dur)||(test_common_flag(CF_RPT_INIT)))
            {
                post_system_flag(SF_USEABLE_SOC_CAL);
                useable_soc_recal_cnt=0;
                
                if(test_common_flag(CF_RPT_INIT))
                {
                    clear_common_flag(CF_RPT_INIT);
                    i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);
                }
            }
            
