NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_algorithm.c
            if(test_system_flag(SF_USEABLE_SOC_CAL)&&!(test_common_flag(CF_BYSOC)))
            {
                clear_system_flag(SF_USEABLE_SOC_CAL);
                enable_cal_useable_soc=1;
                post_system_flag(SF_ABS_NEEDED);
                
                if(battery_type==TUBULAR)
                {
                    need_eq_after_abs=1;
                }
                else
                {
                    need_eq_after_abs=0;
                }
            }
            else
            {
                if(test_common_flag(CF_BYSOC))
                {
                    clear_system_flag(SF_USEABLE_SOC_CAL);
                    post_system_flag(SF_ABS_NEEDED);
                    clear_common_flag(CF_BYSOC);
                    if(!(dev_state_flag&Bit(2)))
                    {
                        dev_state_flag|=Bit(2);
                    }
                    i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);
                }   
            }

            if(test_system_flag(SF_ABS_NEEDED)||(test_common_flag(CF_SET_ABS))||(test_common_flag(CF_SET_EQU)))
            {
                Dynamic_FT_Entry_Enable=0;
                clear_system_flag(SF_ABS_MF);
                clear_system_flag(SF_ABS_NEEDED);
                clear_system_flag(SF_ABS_COMPLETED);
                no_inh_flag=1; /* During Usable SoC calculation, inhibition should not happen*/
                if(test_common_flag(CF_SET_EQU))
                {
                    need_eq_after_abs=1;
                    clear_common_flag(CF_SET_EQU);
                    i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);
                }
        /*Since equalization doesn't happen after every absorption. This flag tells us whether to do an equalization or not after absorption*/
                if(need_eq_after_abs)
                {
                    is_time_to_equ=1;
                }
                else
                {
                    is_time_to_equ=0;
                }
        /*Every time the absorption is completed the battery soc has to be reset*/
        /*The soc is reset the first time battery voltage hits bat_max_v after absorption*/                
                soc_reset_flag=0;
                if(test_common_flag(CF_SET_ABS))
                {
                    clear_common_flag(CF_SET_ABS);
                    i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);
                }                
            }

            Dynamic_FT_Exit=0x00;
            dy_exit=0;
            Dynamic_FT_Exit_Enable = 0;
            
        /*Once dynamic force trip entry is enabled, at sundown the time at which the entry should happen is estimated*/
        /*On the time of entry the time is again calculated and checked with this value inorder to ensure that battery did not discharge between that time period*/
            estimated_ft_entry_time=Dynamic_FT_Entry_Time_Calculate();
            
            if(((algo_param.dev_algo_state == ALGO_STATE_BAT_SOL_FRC_TRIP_6) || (algo_param.dev_algo_state == ALGO_STATE_BAT_FRC_TRIP_4))&&(is_time_to_cal_useable_soc==0))
            {
                algo_param.dev_algo_state = ALGO_STATE_INV_5;
                turtle_set_sw(algo_param.dev_algo_state);
            }
}

void show_led(){
	uint16_t led_colour;
    static uint8_t mains_failure_debug_log_cnt = 0;
    static uint8_t debug_curr_algo_state = 0;
    if((test_error(ANY_ERROR)) || (pac_error_flag)){ //If any error or pac error	
        if(test_error(ERR_NO_MEMORY)){
            ESP_LOGI(TAG,"EEPROM memory allocation");
            blink(led_red_color,FULL_ON);
        }
        else if(test_error((ERR_NOT_CALIB))){
            ESP_LOGI(TAG,"Not calibrated");
            blink(led_red_color,ONE_SECOND_BLINK);
        }
        else if(test_error((ERR_NOT_CONFIG))){
            ESP_LOGI(TAG,"Not configured");
            blink(led_magenta_color,ONE_SECOND_BLINK);
        }
        else if(pac_error_flag){
            blink(led_red_color,FULL_ON);
        }
    } else { // No error or pac error
        if((if_algo_stopped())||(device_state==ALGO_OFF)){
            if(device_state==ALGO_OFF){
                blink(led_no_color,ONE_SECOND_BLINK);
            }
        }
        else
        {
            if(is_sol_sensed == 0){
                ESP_LOGI(TAG,"Solar not detected");
                blink(led_magenta_color,FIVE_SECOND_BLINK);
            }
            else{
                if(test_system_flag(SF_INV_FAIL)){
                    ESP_LOGI(TAG,"Inverter failure");
                    blink(led_red_color,ONE_SECOND_BLINK);
                }
                else{	           
                    if(battery_low==1){
                        ESP_LOGI(TAG,"Battery low");
                        blink(led_red_color,ONE_SECOND_BLINK);
                    }
                    else{
                        if(mains_available == 0) {
                            mains_failure_debug_log_cnt++;
                            if(mains_failure_debug_log_cnt > 100) {
                                ESP_LOGI(TAG, "Mains failure");
                                ESP_LOGI(TAG, "RED LED FIVE SECOND BLINK IS COMMENTED"); //VINEETH
                                //blink(led_red_color,FIVE_SECOND_BLINK); //VINEETH
                                mains_failure_debug_log_cnt = 0;
                            }
                        }
                      //  else{  TODO - VINEETH //  
                        /* As per Akhil's suggestion, red led 5 second blink is 
                           avoided and rest of the cases need to be executed as before
                         */
                            switch(algo_param.dev_algo_state){
                                case ALGO_STATE_INV_5:
                                    if( (debug_curr_algo_state == 0) || (debug_curr_algo_state != ALGO_STATE_INV_5) ) {
                                        ESP_LOGI("ALGO_STATE","STATE 5 [INVERTER MODE]");
                                    }
                                    blink(led_blue_color,ONE_SECOND_BLINK);
                                    break;
                                case ALGO_STATE_CHARG_INHIBIT_1: 
                                    if((debug_curr_algo_state == 0) || (debug_curr_algo_state != ALGO_STATE_CHARG_INHIBIT_1) ) {
                                        ESP_LOGI("ALGO_STATE","STATE 1 [CHARGE INHIBIT MODE]");
                                    }
                                    blink(led_blue_color,FIVE_SECOND_BLINK);
                                    break;
                                case ALGO_STATE_SOL_CHG_3: 
                                    if((debug_curr_algo_state == 0) || (debug_curr_algo_state != ALGO_STATE_SOL_CHG_3) ) {
                                        ESP_LOGI("ALGO_STATE","STATE 3 [SOLAR MODE]");
                                    }
                                    blink(led_blue_color,FIVE_SECOND_BLINK);
                                    break;	
                                case ALGO_STATE_BAT_FRC_TRIP_4: 
                                    if((debug_curr_algo_state == 0) || (debug_curr_algo_state != ALGO_STATE_BAT_FRC_TRIP_4) ) {
                                        ESP_LOGI("ALGO_STATE","STATE 4 [NORMAL FORCE TRIP MODE]");
                                    }
                                    blink(led_green_color,FIVE_SECOND_BLINK);
                                    break;	
                                case ALGO_STATE_BAT_SOL_FRC_TRIP_6: 
                                    if((debug_curr_algo_state == 0) || (debug_curr_algo_state != ALGO_STATE_BAT_SOL_FRC_TRIP_6) ) {
                                        ESP_LOGI("ALGO_STATE","STATE 6 [SOLAR ASSISTED FORCE TRIP MODE]");
                                    }
                                    blink(led_green_color,FIVE_SECOND_BLINK);
                                    break; 
                                case ALGO_STATE_SOL_INV_DIS_7: 
                                    if((debug_curr_algo_state == 0) || (debug_curr_algo_state != ALGO_STATE_SOL_INV_DIS_7) ) {
                                        ESP_LOGI("ALGO_STATE","STATE 7 [SOLAR ASSISTED POWER FAILURE MODE]");
                                    }
                                    blink(led_green_color,ONE_SECOND_BLINK);
                                    break;		
                            }
                            debug_curr_algo_state = algo_param.dev_algo_state;
                      //  }  // TODO -VINEETH
                    }
                }	
            }
        }
    }
}
